[{"type":"log","tags":["title"],"args":"The Matrix"},{"type":"warn","tags":["INFO"],"args":"Computer screen, with flashing cursor.)"},{"type":"log","tags":["Cypher"],"args":"Yeah."},{"type":"log","tags":["Trinity"],"args":"Is everything in place?"},{"type":"log","tags":["Cypher"],"args":"You weren't supposed to relieve me."},{"type":"log","tags":["Trinity"],"args":"I know, but I felt like taking your shift."},{"type":"log","tags":["Cypher"],"args":"You like him, don't you? You like watching him."},{"type":"log","tags":["Trinity"],"args":"Don't be ridiculous."},{"type":"log","tags":["Cypher"],"args":"We're going to kill him, do you understand that?"},{"type":"log","tags":["Trinity"],"args":"Morpheus believes he is The One."},{"type":"log","tags":["Cypher"],"args":"Do you?"},{"type":"log","tags":["Trinity"],"args":"It doesn't matter what I believe."},{"type":"log","tags":["Cypher"],"args":"You don't, do you?"},{"type":"log","tags":["Trinity"],"args":"Did you hear that?"},{"type":"log","tags":["Cypher"],"args":"Hear what?"},{"type":"log","tags":["Trinity"],"args":"Are you sure this line is clean?"},{"type":"log","tags":["Cypher"],"args":"Yeah, 'course I'm sure."},{"type":"log","tags":["Trinity"],"args":"I'd better go."},{"type":"warn","tags":["INFO"],"args":"She hangs up as we pass through the numbers on the screen, and outside the room she is in, as several police officers advance towards the door with flashlights and guns. One kicks open the door."},{"type":"warn","tags":["INFO"],"args":"(Hotel room)"},{"type":"log","tags":["Cop"],"args":"Freeze, Police. Hands on your head. Do it. Do it now."},{"type":"log","tags":["Trinity"],"args":"*slowly puts her hands on her head*"},{"type":"warn","tags":["INFO"],"args":"(Outside hotel)"},{"type":"warn","tags":["INFO"],"args":"A black car with tinted windows pulls up beside the other police cars. Agent Smith and Agent Brown get out of the car, wearing dark suits and sunglasses."},{"type":"log","tags":["Agent Smith"],"args":"Lieutenant..."},{"type":"log","tags":["Lieutenant"],"args":"Oh shit..."},{"type":"log","tags":["Agent Smith"],"args":"You were given _specific_ orders..."},{"type":"log","tags":["Lieutenant"],"args":"Hey, I'm just doing my job. You give me that juris-my-dick-tion crap, you can cram it up your ass."},{"type":"log","tags":["Agent Smith"],"args":"The orders...were for your protection."},{"type":"log","tags":["Lieutenant"],"args":"*laughs* I think we can handle one little girl...I sent two units...they're brining her down now."},{"type":"log","tags":["Lieutenant"],"args":"No Lieutenant, your men are already dead..."},{"type":"warn","tags":["INFO"],"args":"(Hotel Room)"},{"type":"warn","tags":["INFO"],"args":"Cop holds handcuffs, ready to put them on Trinity, who is standing with her back to him, and her hands on her head. Suddenly she spins round, kicks him onto the ground, grabs his gun, and beats up the rest of them. She picks up the phone sitting on the desk."},{"type":"log","tags":["Trinity"],"args":"Morpheus! The line was traced, I don't know how."},{"type":"log","tags":["Morpheus"],"args":"I know, they cut the hard line. There's no time, you're going to have to get to another exit."},{"type":"log","tags":["Trinity"],"args":"Are there any agents?"},{"type":"log","tags":["Morpheus"],"args":"Yes"},{"type":"log","tags":["Trinity"],"args":"Goddamnit."},{"type":"log","tags":["Morpheus"],"args":"You have to focus, Trinity. There's a phone at Wells and Lake. You can make it."},{"type":"log","tags":["Trinity"],"args":"*sigh* All right."},{"type":"log","tags":["Morpheus"],"args":"Go!"},{"type":"warn","tags":["INFO"],"args":"Trinity drops the phone and bursts out of the room, just as Agent Brown enters the hall, leading another unit of police. Trinity races to the opposite end, exiting through a broken window onto the fire escape. She looks down, and sees Agent Smith below, staring at her. She goes upwards, onto the roof. On the roof, Trinity is running as Agent Brown arrives after her, leading the group of cops in pursuit. Trinity begins to jump from one roof to the other, in one fluid motion, in comparison to the wild jumps of the cops. Agent Brown, however, has the same unnatural grace. They reach a huge gap between two buildings, which Trinity jumps with no problem."},{"type":"warn","tags":["INFO"],"args":"(Rooftop)"},{"type":"log","tags":["Cop"],"args":"That's impossible!"},{"type":"warn","tags":["INFO"],"args":"They stare as Agent Smith duplicates the move exactly, following her onto the next roof. She hides behind a chimney, as he looks around the rooftop, searching for her. Not far off, she sees a window, and makes a dash for it. She dives through the window, rolls down the stairs inside, and manages to land without much damage."},{"type":"log","tags":["Trinity"],"args":"Get up Trinity. Just get up. Get up!"},{"type":"warn","tags":["INFO"],"args":"(Street)"},{"type":"warn","tags":["INFO"],"args":"Trinity emerges from an alleyway, and at the end of the block, she sees a telephone booth. As she watches, the phone begins to ring. As it rings, a truck pulls up in front of it, it's headlights pointing towards the phone. Trinity suddenly runs for the phone box, racing the truck as it almost manages to crush the phone booth, just as she answers the phone. She puts her hand out to the glass of the booth, just as the truck hits it. In a few moments, we see the remains of the phone box. Agent Smith inspects the wreckage. There is no body."},{"type":"log","tags":["Agent Brown"],"args":"She got out."},{"type":"log","tags":["Agent Smith"],"args":"It doesn't matter."},{"type":"log","tags":["Agent Jones"],"args":"The informant is real."},{"type":"log","tags":["Agent Smith"],"args":"Yes..."},{"type":"log","tags":["Agent Jones"],"args":"We have the name of their next target.."},{"type":"log","tags":["Agent Brown"],"args":"The name is Neo..."},{"type":"log","tags":["Agent Smith"],"args":"We'll need a search running.."},{"type":"log","tags":["Agent Jones"],"args":"It has already begun."},{"type":"warn","tags":["INFO"],"args":"We are zoomed in towards the mouthpiece of the phone on the ground, closer, until we appear to travel down it and through the cable. We appear in Neo's apartment. He is asleep at his computer, with headphones on. On his computer screen, we see he is running a search on a man named Morpheus. Suddenly on his computer screen appear the words 'Wake up, Neo.' He sits up, and stares at his computer screen"},{"type":"log","tags":["Neo"],"args":"What?"},{"type":"warn","tags":["INFO"],"args":"On the computer, now appears 'The Matrix has you...'"},{"type":"log","tags":["Neo"],"args":"What the hell?"},{"type":"warn","tags":["INFO"],"args":"On the computer, now appears 'Follow the white rabbit...'"},{"type":"log","tags":["Neo"],"args":"Follow the white rabbit?"},{"type":"warn","tags":["INFO"],"args":"He presses the 'esc' key repeatedly, no effect. the computer comes up with one last message: 'Knock knock, Neo.' There is a loud knock at his door, and he jumps. He stares at the door, and then back at his computer screen. it's now blank."},{"type":"log","tags":["Neo"],"args":".....Who is it?"},{"type":"log","tags":["Choi"],"args":"It's Choi."},{"type":"log","tags":["Neo"],"args":"Yeah...yeah...you're two hours late."},{"type":"log","tags":["Choi"],"args":"I know, it's her fault."},{"type":"warn","tags":["INFO"],"args":"Choi gestures towards DuJour"},{"type":"log","tags":["Neo"],"args":"You got the money?"},{"type":"log","tags":["Choi"],"args":"Two grand."},{"type":"log","tags":["Neo"],"args":"Hold on."},{"type":"warn","tags":["INFO"],"args":"Neo goes into his apartment, shuts the door, and opens a book, takes out a CD rom, and goes back to the door, handing the CD to Choi"},{"type":"log","tags":["Choi"],"args":"Hallelujah. You're my saviour, man. My own personal Jesus Christ."},{"type":"log","tags":["Neo"],"args":"You get caught using that..."},{"type":"log","tags":["Choi"],"args":"Yeah, I know. This never happened, you don't exist."},{"type":"log","tags":["Neo"],"args":"Right."},{"type":"log","tags":["Choi"],"args":"Something wrong, man? You look a little whiter than usual."},{"type":"log","tags":["Neo"],"args":"My computer....it..you ever have that feeling where you don't know if you're awake or still dreaming?"},{"type":"log","tags":["Choi"],"args":"Mm, all the time. It's called Mescaline. It's the only way to fly. Hey, it sounds to me like you need to unplug, man. You know, get some R and R. What do you think DuJour? Should we take him with us?"},{"type":"log","tags":["DuJour"],"args":"*looks Neo up and down* Definitely."},{"type":"log","tags":["Neo"],"args":"No, I can't, I got work tomorrow."},{"type":"log","tags":["DuJour"],"args":"Come on, it'll be fun. *looks Neo up and down again* I promise."},{"type":"warn","tags":["INFO"],"args":"Neo notices DuJour has a tattoo of a white rabbit on her shoulder."},{"type":"log","tags":["Neo"],"args":"Yeah, sure, I'll go."},{"type":"warn","tags":["INFO"],"args":"Neo, Choi and DuJour arrive in a club. Neo is standing next to a wall, doing nothing. A woman walks up to him. The woman is Trinity."},{"type":"log","tags":["Trinity"],"args":"Hello Neo."},{"type":"log","tags":["Neo"],"args":"How do you know that name?"},{"type":"log","tags":["Trinity"],"args":"I know a lot about you."},{"type":"log","tags":["Neo"],"args":"Who are you?"},{"type":"log","tags":["Trinity"],"args":"My name is Trinity."},{"type":"log","tags":["Neo"],"args":"Trinity..._The_ Trinity? The one the cracked the IRS d-base?"},{"type":"log","tags":["Trinity"],"args":"That was a long time ago."},{"type":"log","tags":["Neo"],"args":"Jesus!"},{"type":"log","tags":["Trinity"],"args":"What?"},{"type":"log","tags":["Neo"],"args":"I just thought, um...you were a guy."},{"type":"log","tags":["Trinity"],"args":"Most guys do."},{"type":"log","tags":["Neo"],"args":"That was you on my computer. How did you do that?"},{"type":"log","tags":["Trinity"],"args":"Never mind, right now all I can tell you is that you're in danger. I brought you here to warn you."},{"type":"log","tags":["Neo"],"args":"What about?"},{"type":"log","tags":["Trinity"],"args":"They're watching you, Neo."},{"type":"log","tags":["Neo"],"args":"Who is?"},{"type":"log","tags":["Trinity"],"args":"Please, just listen. I know why you're here, Neo. I know what you've been doing. I know why you hardly sleep, and why night after night you sit at your computer. You're looking for him. I know, because I was once looking for the same thing. And when he found me, he told me I wasn't really looking for him, I was looking for an answer. It's the question that drives us, Neo. It's the question that brought you here. You know the question, just as I did..."},{"type":"log","tags":["Neo"],"args":"What is the Matrix?"},{"type":"log","tags":["Trinity"],"args":"The answer is out there, Neo. It's looking for you...and it will find you...if you want it to...."},{"type":"warn","tags":["INFO"],"args":"Neo wakes up late in the morning and looks at his clock."},{"type":"log","tags":["Neo"],"args":"Oh sh*t. Oh sh*t sh*t sh*t!"},{"type":"warn","tags":["INFO"],"args":"Neo is standing in his bosses office at the software company he works for."},{"type":"log","tags":["Rhineheart"],"args":"You have a problem with authority, Mr. Anderson. You believe that you are special, that somehow the rules do not apply to you. Obviously you are mistaken. This company is one of the top software companies in the world because every single employee understands that they are part of a whole. Thus if an employee has a problem, the company has a problem. The time has come to make a choice, Mr. Anderson. Either you choose to be at your desk, on time, from this day forward - or you choose to find yourself another job. Do I make myself perfectly clear?"},{"type":"log","tags":["Neo"],"args":"Yes Mr. Rhineheart, perfectly clear."},{"type":"warn","tags":["INFO"],"args":"Neo is sitting at his computing in his cubicle, when a voice says"},{"type":"log","tags":["Fed-Ex Guy"],"args":"Thomas Anderson?"},{"type":"log","tags":["Neo"],"args":"Yeah, that's me."},{"type":"log","tags":["Fed-Ex Guy"],"args":"Just sign here.."},{"type":"warn","tags":["INFO"],"args":"Neo signs the paper"},{"type":"log","tags":["Fed-Ex Guy"],"args":"Ok, that's great. Have a nice day!"},{"type":"warn","tags":["INFO"],"args":"Neo scowls at his back. He opens the parcel, inside is a cellular phone. As soon as he picks it up, it rings. He jumps, and picks it up."},{"type":"log","tags":["Neo"],"args":"Hello...?"},{"type":"log","tags":["Morpheus"],"args":"Hello, Neo. Do you know who this is?"},{"type":"log","tags":["Neo"],"args":"Morpheus?"},{"type":"log","tags":["Morpheus"],"args":"Yes...I've been looking for you, Neo. I don't know if you're ready to see what I want to show you, but unfortunately you and I have run out of time. They're coming for you, Neo, and I don't know what they're going to do."},{"type":"log","tags":["Neo"],"args":"Who's coming for me?"},{"type":"log","tags":["Morpheus"],"args":"Stand up and see for yourself."},{"type":"log","tags":["Neo"],"args":"What, now?"},{"type":"log","tags":["Morpheus"],"args":"Yes, right now. Do it slowly. The elevator..."},{"type":"warn","tags":["INFO"],"args":"Neo slowly stands up and looks over the partition. At the elevator, he sees Agent Brown and Agent Jones leading a group of cops. A female employee turns and points out Neo's cubicle. Neo ducks."},{"type":"log","tags":["Neo"],"args":"Oh shit."},{"type":"log","tags":["Morpheus"],"args":"Yes."},{"type":"log","tags":["Neo"],"args":"What the hell do they want from me?"},{"type":"log","tags":["Morpheus"],"args":"I don't know, but if you don't want to find out, I suggest you get out of there."},{"type":"log","tags":["Neo"],"args":"How?"},{"type":"log","tags":["Morpheus"],"args":"I can guide you, but you must do exactly as I say."},{"type":"log","tags":["Neo"],"args":"Okay..."},{"type":"log","tags":["Morpheus"],"args":"The cubicle across from you is empty."},{"type":"log","tags":["Neo"],"args":"What if they...."},{"type":"log","tags":["Morpheus"],"args":"Go, now."},{"type":"warn","tags":["INFO"],"args":"Neo lunges across the hall, diving into the other cubicle just as the agents turn into his row. He hides in a dark corner"},{"type":"log","tags":["Morpheus"],"args":"Stay here for just a moment. When I tell you, go to the end of the row, to the office at the end of the hall. Stay as low as you can...Go, now!"},{"type":"warn","tags":["INFO"],"args":"Neo runs to the door, opens it, goes in, and shuts the door."},{"type":"log","tags":["Morpheus"],"args":"Now, outside there is a scaffold."},{"type":"log","tags":["Neo"],"args":"How do you know all this?"},{"type":"log","tags":["Morpheus"],"args":"We don't have time, Neo. To your left there is a window. Go to it....open it. You can use the scaffold to get to the roof."},{"type":"log","tags":["Neo"],"args":"No _way_! No way! This is crazy!"},{"type":"log","tags":["Morpheus"],"args":"There are two ways out of this building. One is that scaffold, the other is in their custody. You take a chance either way. I leave it to you."},{"type":"warn","tags":["INFO"],"args":"Morpheus hangs up."},{"type":"warn","tags":["INFO"],"args":"Neo looks out the window."},{"type":"log","tags":["Neo"],"args":"This is insane! Why is this happening to me? What did I do?! Nothing."},{"type":"warn","tags":["INFO"],"args":"He climbs out the window onto the window ledge. Hanging onto the frame, he steps onto the small ledge. The wind suddenly blasts up the face of the building, knocking Neo off balance. Recoiling, he clings harder to the frame, and the phone falls out of his hand. He watches as it is swallowed by the distance beneath him."},{"type":"log","tags":["Neo"],"args":"This is insane. I can't do this. Forget it!"},{"type":"warn","tags":["INFO"],"args":"Neo climbs back into the office, just as a cop opens the door."},{"type":"warn","tags":["INFO"],"args":"The agents take Neo, handcuffed, out of the building, and into their car. Trinity is sitting on a motorbike in front of the car, watching them in her rear view mirror."},{"type":"log","tags":["Trinity"],"args":"Sh*t"},{"type":"warn","tags":["INFO"],"args":"Neo is sitting at a table by himself in a small room. The door opens and the agents enter. Agent Smith sits down across from Neo with a folder in front of him."},{"type":"log","tags":["Agent Smith"],"args":"As you can see, we've had our eye on you for some time now, _Mr._ Anderson. It seems you have been living..two lives. In one life, you're Thomas A. Anderson, program writer for a _respectable_ software company....you have a social security number, you pay your taxes, and you...help your landlady carry out her _garbage_. The other life is lived in computers, where you go by the hacker alias 'Neo', and are guilty of virtually every computer crime we have a law for. One of these lives has a future....the other does _not_... I'm going to be as forthcoming as I can, _Mr._ Anderson. You're here because we need your help. We know that you've been contacted by a certain individual, a man who calls himself...Morpheus. Now whatever you _think_ you know about this man is irrelevant. He is considered by many authorities to be the most dangerous man alive. My colleagues believe that I am wasting my time with you, but I believe you wish to do the right thing. We're willing to wipe the slate clean, give you a fresh start, and all that we're asking in return is your co-operation in bringing a known terrorist to justice."},{"type":"log","tags":["Neo"],"args":"Yeah...Wow, that sounds like a really good deal. But I think I got a better one. How about...I give you the finger..."},{"type":"warn","tags":["INFO"],"args":"Neo does so"},{"type":"log","tags":["Neo"],"args":"....And you give _me_ my phone call."},{"type":"log","tags":["Agent Smith"],"args":"*glare* _Mr._ Anderson, you disappoint me."},{"type":"log","tags":["Neo"],"args":"You can't scare me with this Gestapo crap. I know my rights. I _want_ my phone call."},{"type":"log","tags":["Agent Smith"],"args":"And tell me, _Mr._ Anderson, what good is a phone call...if you are unable to speak."},{"type":"warn","tags":["INFO"],"args":"The question unnerves Neo and strangely, he begins to feel the muscles in his jaw tighten."},{"type":"warn","tags":["INFO"],"args":"The standing agents snicker, watching Neo's confusion grow into panic."},{"type":"warn","tags":["INFO"],"args":"Neo feels his lips grow soft and sticky as they slowly seal shut, melding into each other until all trace of his mouth is gone. Wild with fear, he lunges for the door but the agents restrain him, holding him down onto the table."},{"type":"log","tags":["Agent Smith"],"args":"You're going to help us, _Mr._ Anderson, whether _you_ like it or not."},{"type":"warn","tags":["INFO"],"args":"Smith nods and the other two rip open his shirt. From a case taken out of his suit coat, Smith removes a long, fiber-optic wire tap. Neo struggles helplessly as Smith dangles the wire over his exposed abdomen. Horrified, he watches as the electronic device animates, become an organic creature that resembles a hybrid of an insect and a fluke worm. Thin, whisker-like tendrils reach out and probe into Neo's navel. He bucks wildly as Smith drops the creature which looks for a moment like an uncut umbilical cord - Before it begins to burrow, its tail thrashing as it worms its way inside."},{"type":"warn","tags":["INFO"],"args":"Screaming, Neo wakes up in his bed, in his apartment, sweating. He puts his hand to his mouth, and finds it's perfectly normal. The phone beside his bed rings. He jumps, and picks it up, cautiously."},{"type":"log","tags":["Neo"],"args":".......Hello....?"},{"type":"log","tags":["Morpheus"],"args":"This line is tapped, so I must be brief. They got to you first, but they're underestimated how important _you_ are... If they knew what I know, you would probably be dead."},{"type":"log","tags":["Neo"],"args":"What are you talking about? What is happening to me?"},{"type":"log","tags":["Morpheus"],"args":"You are The One, Neo. You see, you may have spent the last few years of your life looking for me, but I've spent my entire _life_ looking for you. Now do you still want to meet?"},{"type":"log","tags":["Neo"],"args":".....Yes...."},{"type":"log","tags":["Morpheus"],"args":"Then go to the Adam's Street bridge."},{"type":"warn","tags":["INFO"],"args":"Neo stands under the bridge, as a black car pulls up and the door opens. It's Trinity."},{"type":"log","tags":["Trinity"],"args":"Get in."},{"type":"warn","tags":["INFO"],"args":"Neo gets into the car, as the driver, a blond woman named Switch, turns around in her seat and points a gun at him."},{"type":"log","tags":["Neo"],"args":"What the hell is this?"},{"type":"log","tags":["Trinity"],"args":"It's necessary, Neo. For our protection."},{"type":"log","tags":["Neo"],"args":"From what?"},{"type":"log","tags":["Trinity"],"args":"From you..."},{"type":"log","tags":["Switch"],"args":"Take off your shirt."},{"type":"log","tags":["Neo"],"args":"What?"},{"type":"log","tags":["Switch"],"args":"Stop the car. Listen to me, Coppertop. We don't have time for twenty questions. Right now, there's only one rule: 'Our way - or the highway'."},{"type":"log","tags":["Neo"],"args":"Fine..."},{"type":"warn","tags":["INFO"],"args":"Neo starts to get out of the car....Trinity stops him"},{"type":"log","tags":["Trinity"],"args":"Please Neo, you have to trust me. Neo"},{"type":"log","tags":["Trinity"],"args":"Because you have been down there, Neo. You know that road. You know exactly where it ends. And I know that's not where you want to be..... Neo slowly gets back into the car Trinity looks at the man in the passenger seat"},{"type":"log","tags":["Trinity"],"args":"Apoc, lights."},{"type":"warn","tags":["INFO"],"args":"She turns to Neo again"},{"type":"log","tags":["Trinity"],"args":"Lie back, lift up your shirt."},{"type":"warn","tags":["INFO"],"args":"Neo looks at the device in her hand."},{"type":"log","tags":["Neo"],"args":"What _is_ that thing?"},{"type":"log","tags":["Trinity"],"args":"We think you're bugged....Try and relax..."},{"type":"warn","tags":["INFO"],"args":"Trinity looks at the display on the device she's holding and presses it against Neo's abdomen, talking to herself as she attempts to remove the bug from him."},{"type":"log","tags":["Trinity"],"args":"Come on...come on..."},{"type":"log","tags":["Switch"],"args":"It's on the move....you're going to loose it..."},{"type":"log","tags":["Trinity"],"args":"No I'm not...clear."},{"type":"warn","tags":["INFO"],"args":"The bug appears in the jar attached to the device she was using, and she empties it out of the window into the street. It turns back into a mechanical object and it's red 'eyes' fade and then go out."},{"type":"log","tags":["Neo"],"args":"Jesus Christ, that thing's real??!!"},{"type":"warn","tags":["INFO"],"args":"They arrive at a hotel, and Trinity takes Neo to a closed door. She turns and faces him."},{"type":"log","tags":["Trinity"],"args":"This is it..let me give you one piece of advice. Be honest-he knows more than you can imagine."},{"type":"warn","tags":["INFO"],"args":"Neo opens the door, and walks in to see a dark figure staring out of the window. He turns and smiles at Neo."},{"type":"log","tags":["Morpheus"],"args":"At last. Welcome, Neo. As you no doubt have guessed, I am Morpheus."},{"type":"log","tags":["Neo"],"args":"It's an honour to meet you."},{"type":"log","tags":["Morpheus"],"args":"No, the honour is mine....Please, come, sit."},{"type":"warn","tags":["INFO"],"args":"Neo sits down in the armchair."},{"type":"log","tags":["Morpheus"],"args":"I imagine that right now you're feeling a bit like Alice..."},{"type":"log","tags":["Neo"],"args":".....?"},{"type":"log","tags":["Morpheus"],"args":"Tumbling down the rabbit hole? Hmm?"},{"type":"log","tags":["Neo"],"args":"You....could say that."},{"type":"log","tags":["Morpheus"],"args":"I can see it in your eyes. You have the look of a man who accepts what he sees, because he is expecting to wake up. Ironically, this is not far from the truth...."},{"type":"warn","tags":["INFO"],"args":"Morpheus sits down in the armchair opposite from Neo"},{"type":"log","tags":["Morpheus"],"args":"Do you believe in fate, Neo?"},{"type":"log","tags":["Neo"],"args":"No."},{"type":"log","tags":["Morpheus"],"args":"Why?"},{"type":"log","tags":["Neo"],"args":"Because I don't like the idea that I'm not in control of my own life."},{"type":"log","tags":["Morpheus"],"args":"I know..._exactly_ what you mean. Let me tell you why you're here. You're here because you know something. What you know, you can't explain. But you feel it. You've felt it your entire life. That there's something _wrong_ with the world. You don't know what it is, but it's there...like a splinter in you're mind, driving you mad. It is this feeling that has brought you to me. Do you _know_ what I'm talking about?"},{"type":"log","tags":["Neo"],"args":"The Matrix?"},{"type":"log","tags":["Morpheus"],"args":"Do you want to know...._what_ _it_ is....?"},{"type":"warn","tags":["INFO"],"args":"Neo nods"},{"type":"log","tags":["Morpheus"],"args":"The Matrix is everywhere. It's all around us, even in this very room. You can see it when you look out your window or when you turn on your television. You can feel it when you go to work, when you go to work, when you pay your taxes. The Matrix is the world that has been pulled over your eyes, to blind you from the truth."},{"type":"log","tags":["Neo"],"args":"What truth?"},{"type":"log","tags":["Morpheus"],"args":"That you are a slave, Neo. Like everyone else, you were born into bondage, born into a prison that you cannot smell or taste or touch. A prison...for your mind....Unfortunatly, no one can be..._told_ what the Matrix is...you have to see it for yourself."},{"type":"warn","tags":["INFO"],"args":"Morpheus opens a container which holds two pills: a blue one, and a red one. He puts one in each hand, and holds them out to Neo."},{"type":"log","tags":["Morpheus"],"args":"This is your _last chance_. After this, there is no turning back.....You take the blue pill, the story ends. You wake up and belive...whatever you want to believe. You take the red pill.....you stay in wonderland...and I show you just how deep the rabbit hole goes."},{"type":"warn","tags":["INFO"],"args":"Neo pauses for an instant, then reaches for the red pill. He swallows it down with a glass of water, and looks at Morpheus."},{"type":"log","tags":["Morpheus"],"args":"Remember...all I'm offering you is the truth: nothing more."},{"type":"warn","tags":["INFO"],"args":"Morpheus half smiles at Neo."},{"type":"log","tags":["Morpheus"],"args":"Follow me....."},{"type":"warn","tags":["INFO"],"args":"They walk through double doors into a room with computer terminals and other machines. Morpheus speaks to Apoc"},{"type":"log","tags":["Morpheus"],"args":"Apoc, are we online?"},{"type":"log","tags":["Apoc"],"args":"Almost..."},{"type":"warn","tags":["INFO"],"args":"Trinity and Apoc are busy wiring a complex system of monitors, modules and drives."},{"type":"log","tags":["Morpheus"],"args":"Time is always against us. Please, take a seat there."},{"type":"warn","tags":["INFO"],"args":"Morpheus gestures towards another arm chair. Neo cautiously sits down, still looking at all the computer terminals and wires."},{"type":"log","tags":["Neo"],"args":"You did all this?"},{"type":"log","tags":["Trinity"],"args":"Uh huh."},{"type":"log","tags":["Morpheus"],"args":"The pill you took is part of a tracing program. It's designed to disrupt your input/output carrier signals so we can pinpoint your location."},{"type":"warn","tags":["INFO"],"args":"Neo looks confused."},{"type":"log","tags":["Neo"],"args":"What does that mean?"},{"type":"warn","tags":["INFO"],"args":"Cypher looks up from his computer terminal."},{"type":"log","tags":["Cypher"],"args":"It means, Buckle your seat belt Dorothy...'cause Kansas...is going bye-bye."},{"type":"warn","tags":["INFO"],"args":"As Neo looks at an old cracked dressing mirror nearby, it appears to show his image twice. As he stares at it, he speaks to Morpheus"},{"type":"log","tags":["Neo"],"args":"Did you....?"},{"type":"warn","tags":["INFO"],"args":"Morpheus ignores his question"},{"type":"log","tags":["Morpheus"],"args":"Have you ever had a dream, Neo, that you were so sure was real? What if you were unable to wake from that dream? How would you know the difference, between the dream world...and the real world....?"},{"type":"warn","tags":["INFO"],"args":"As Neo curiously reaches out to touch the mirror, it wobbles, and appears to stick to his hand."},{"type":"log","tags":["Neo"],"args":"This can't be...."},{"type":"log","tags":["Morpheus"],"args":"Be what? Be _real_?"},{"type":"warn","tags":["INFO"],"args":"As Neo pulls away, the strands thin like rubber cement as he pulls away, until the fragile wisps of mirror break, and only a tiny fragment of the liquid is left. He looks at it, and it begins to consume his hand, crawling up his arm. He squirms."},{"type":"log","tags":["Trinity"],"args":"It's going into replication!"},{"type":"log","tags":["Morpheus"],"args":"Apoc?"},{"type":"log","tags":["Apoc"],"args":"Still nothing..."},{"type":"warn","tags":["INFO"],"args":"The liquid has covered all of Neo's right arm by now, and works it's way up his shoulder to his neck"},{"type":"log","tags":["Neo"],"args":"It's cold!! It's cold!..."},{"type":"warn","tags":["INFO"],"args":"Morpheus takes out a cellular phone, and dials a number"},{"type":"log","tags":["Morpheus"],"args":"Tank, we're going to need a signal soon."},{"type":"warn","tags":["INFO"],"args":"Neo begins to panic, as he tips his head up as if he's sinking into the mirror, trying to keep his mouth up."},{"type":"log","tags":["Trinity"],"args":"We've got a fibrillation!"},{"type":"log","tags":["Morpheus"],"args":"Apoc! Location!"},{"type":"log","tags":["Apoc"],"args":"Targeting, almost there!"},{"type":"warn","tags":["INFO"],"args":"By now Neo is almost totally consumed by the liquid, squirming as it works it way up his face."},{"type":"log","tags":["Trinity"],"args":"He's going into arrest!"},{"type":"log","tags":["Apoc"],"args":"LOCK, I got him!"},{"type":"log","tags":["Morpheus"],"args":"Now, Tank! Now!"},{"type":"warn","tags":["INFO"],"args":"The mirror liquid pours down Neo's throat, as he screams, and we travel down his throat with it, and then get swallowed by total darkness."},{"type":"warn","tags":["INFO"],"args":"We emerge in a cocoon filled with a red gelatin-like liquid. Neo is attached to the sides of it by wires, tubes and things which look like IV lines. He struggles, air bubbles into the gelatine, but does not break the surface. As he presses up, the surface distends, stretching like a red rubber cocoon. Unable to breathe, he fights for stand, and eventually ruptures the surface, creating a hole which he uses to gasp for air. Tearing himself free, he emerges from the cell. Neo is bald and naked, and covered in the gelatine. He's dizzy, and unable to stand properly, as he waits for his vision to focus. He is standing in an oval capsule of clear alloy filled with red gelatine, the surface of which has solidified like curdled milk. The IVs in his arms are plugged into outlets that appear to be grafted to his flesh. He feels the weight of another cable and reaches to the back of his head where he finds an enormous coaxial plugged and locked into the base of his skull. He tries to pull it out, but can't. To either side he sees other tube-shaped pods filled with red gelatine; beneath the wax-like surface, pale and motionless, he sees other human beings. Fanning out in a circle, there are more. All connected to a centre core, each capsule attached to a black metal stem. Above him, level after, level, the stem rises seemingly forever. He moves to the foot of the capsule and looks out. Towers of glowing petals spiral up to incomprehensible heights, disappearing down into a dim murk like an underwater abyss. Below Neo, a petal detaches from the stem, bearing away the body of an old man like anautomated barge even as a new pod rises up and plugs itself into the empty space. Inside the new capsule, its surface more translucent and pinkish in colour, Neo sees a small baby. From above, a machine drops directly in front of him. He swallows his scream as it seems to stare at him. A black particle beam washes over Neo, he reacts in pain as the scanner seems to expose the nervous system wired to the coaxial cable at his cerebral cortex. At the back of the neck, the cable lock spins and opens, disengaging. The cable pulls itself free, a long clear plastic needle and cerebrum-chip slides from the interior of Neo's skull with an ooze of blood and spinal fluid. The other connective hoses snap free and snake away as the back of the unit opens and a tremendous vacuum, like an aeroplane door opening, sucks the gelatine and then Neo into a black hole. The pipe is a waste disposal system, and Neo falls, sliding down it, screaming his lungs out. He falls out of the end of the pipe, into a body of water. As he begins to drown, he is suddenly snatched up by a machine. The metallic cable then lifts, pulling him up into a flying machine of some sort, as the doors close and we fade to black."},{"type":"warn","tags":["INFO"],"args":"(hovercraft)"},{"type":"warn","tags":["INFO"],"args":"The metal harness opens and drops the half-conscious Neo onto the floor. Human hands and arms help him up as he finds himself looking straight at Morpheus, Trinity and Apoc, along with others he doesn't recognize. Morpheus smiles, and speaks quietly to Neo."},{"type":"log","tags":["Morpheus"],"args":"Welcome to the real world...."},{"type":"warn","tags":["INFO"],"args":"Neo passes out. As he is unconscious, Morpheus and Trinity talk in hushed voices"},{"type":"log","tags":["Morpheus"],"args":"...We've done it, Trinity...we've found him."},{"type":"log","tags":["Trinity"],"args":"I hope you're right..."},{"type":"log","tags":["Morpheus"],"args":"I don't _have_ to hope. I know it."},{"type":"warn","tags":["INFO"],"args":"Neo wakes up later on, and looks at Trinity and Morpheus, who are standing watching him."},{"type":"log","tags":["Neo"],"args":"....Am I dead?"},{"type":"log","tags":["Morpheus"],"args":"Far from it..."},{"type":"warn","tags":["INFO"],"args":"Neo passes out again. Later on, he wakes up. He sees his body pierced with dozens of acupuncture-like needles wired to a strange device."},{"type":"log","tags":["Dozer"],"args":"He still needs a lot of work."},{"type":"log","tags":["Neo"],"args":"What are you doing?"},{"type":"log","tags":["Morpheus"],"args":"Your muscles have atrophied, we're rebuilding them."},{"type":"log","tags":["Neo"],"args":"Why do my eyes hurt?"},{"type":"warn","tags":["INFO"],"args":"Neo blinks"},{"type":"log","tags":["Morpheus"],"args":"You've never used them before."},{"type":"warn","tags":["INFO"],"args":"Neo looks confused"},{"type":"log","tags":["Morpheus"],"args":"Rest, Neo, the answers are coming."},{"type":"warn","tags":["INFO"],"args":"Neo passes out again. When he wakes up, he's lying on a bed in a room. He begins to examine himself. There is a futuristic IV plugged into the jack in his forearm. He pulls it out, staring at the grafted outlet. He feels his bald head. His fingers find and explore the large outlet in the base of his skull. Just as it starts to come unglued, Morpheus opens the door and walks in."},{"type":"log","tags":["Neo"],"args":"Morpheus, what's happened to me?"},{"type":"log","tags":["Morpheus"],"args":"More important than 'what?' is _'when?'_"},{"type":"log","tags":["Neo"],"args":"When?"},{"type":"log","tags":["Morpheus"],"args":"You believe that it is the year 1999, when in fact is closer to _2199_. I can't tell you _exactly_ what year it is, because we honestly don't know. There's nothing I can see that will explain it for you, Neo...Come with me, see for yourself."},{"type":"warn","tags":["INFO"],"args":"Neo follows Morpheus rather unsteadily through the door."},{"type":"log","tags":["Morpheus"],"args":"This is my ship, the Nebuchadnezzar...."},{"type":"warn","tags":["INFO"],"args":"Morpheus gestures around him"},{"type":"log","tags":["Morpheus"],"args":"It's a hovercraft. This is the main deck...This is the core, where we broadcast our pirate signal, and...hack into the Matrix. They enter a room where the other people Neo has met are all standing, or sitting at computer terminals."},{"type":"log","tags":["Morpheus"],"args":"Most of my crew, you already know."},{"type":"warn","tags":["INFO"],"args":"Trinity nods and smiles"},{"type":"log","tags":["Morpheus"],"args":"This is Apoc, Switch, and Cypher."},{"type":"warn","tags":["INFO"],"args":"Cypher smiles"},{"type":"log","tags":["Cypher"],"args":"Hi."},{"type":"log","tags":["Morpheus"],"args":"The ones you don't know, Tank, and his big brother, Dozer...The little one behind you is Mouse."},{"type":"warn","tags":["INFO"],"args":"Mouse smiles at Neo and waves slightly shyly, Morpheus looks at him, then turns back to Neo."},{"type":"log","tags":["Morpheus"],"args":"You wanted to know...what the Matrix is, Neo?"},{"type":"warn","tags":["INFO"],"args":"Neo nods unsteadily"},{"type":"warn","tags":["INFO"],"args":"Morpheus nods to Trinity"},{"type":"log","tags":["Morpheus"],"args":"Trinity..."},{"type":"warn","tags":["INFO"],"args":"Trinity approaches Neo, and helps him into an armchair, strapping in his feet, and leaning his head back against the head rest."},{"type":"warn","tags":["INFO"],"args":"Morpheus looks at Neo"},{"type":"log","tags":["Morpheus"],"args":"Try to relax...this will feel....a little _weird_."},{"type":"warn","tags":["INFO"],"args":"As Morpheus guides a coaxial line into the jack at the back of his neck, Neo screams and makes a few other disturbing noises. When he opens his eyes, he is standing in a totally white place. His hair is back, and he is wearing different clothes. As Neo spins around a bit, trying to see what's going on, Morpheus appears in front of him."},{"type":"log","tags":["Morpheus"],"args":"This is the construct. It is our loading program. We can load anything from clothing, to equipment, weapons, training simulations, anything we need."},{"type":"warn","tags":["INFO"],"args":"Neo is having a hard time getting a grasp of this."},{"type":"log","tags":["Neo"],"args":"Right now....we're inside a computer program?"},{"type":"log","tags":["Morpheus"],"args":"Is it really so hard to belive? Your clothes are different. The plugs in your arms and head are gone. Your hair has changed."},{"type":"warn","tags":["INFO"],"args":"Neo puts a hand to his head and touches his hair"},{"type":"log","tags":["Morpheus"],"args":"Your appearance now is what we call residual self image."},{"type":"warn","tags":["INFO"],"args":"It is the mental projection...of your digital self. Two chairs appear in front of them, and Neo reaches out to touch one. He runs his hand along it's back."},{"type":"log","tags":["Neo"],"args":"This....this isn't real?"},{"type":"warn","tags":["INFO"],"args":"Morpheus looks at him"},{"type":"log","tags":["Morpheus"],"args":"What _is_ real? How do you _define_ real? If you're talking about what you can feel, what you can smell, what you can taste and see, then real is simply electrical signals interpreted by your brain."},{"type":"warn","tags":["INFO"],"args":"A television appears in front of the two chairs, as Neo sits down in the chair beside Morpheus. Morpheus picks up the television control and turns it on."},{"type":"log","tags":["Morpheus"],"args":"_This_ is the world that you know. The world as it was at the end of the twentieth century. It exists now only as part of a neural-interactive simulation, that _we_ call the Matrix."},{"type":"warn","tags":["INFO"],"args":"Morpheus turns to Neo"},{"type":"log","tags":["Morpheus"],"args":"You've been living in a dream world, Neo. This...is the world as it exists today."},{"type":"warn","tags":["INFO"],"args":"Morpheus changes the channel on the televison. The sky is an endless sea of black and green bile. The earth, scorched and split like burnt flesh, spreads out beneath us as we enter the television."},{"type":"log","tags":["Morpheus"],"args":"Welcome.....to the desert of the real...We have only bits and pieces of information, but what we know for certain is that some point in the early twenty-first century all of mankind was united in celebration. We marvelled at our own magnificence...."},{"type":"warn","tags":["INFO"],"args":"Neo looks confused"},{"type":"log","tags":["Morpheus"],"args":".....as we gave birth...to A.I."},{"type":"log","tags":["Neo"],"args":"A.I. - you mean Artificial Intelligence?"},{"type":"log","tags":["Morpheus"],"args":"A singular consciousness that spawned an entire race of machines. We don't know who struck first - us, or them. But we know it was us that scorched the sky. At the time they were dependent on solar power and it was believed that they would be unable to survive without an energy source as abundant as the sun. Throughout human history, we have been dependent on machines to survive. Fate, it seems, is not without a sense of irony."},{"type":"warn","tags":["INFO"],"args":"Neo stares at Morpheus, with his mouth open."},{"type":"log","tags":["Morpheus"],"args":"The human generates more bio-electricity than 120-volt battery and over 25,000 BTVs of body heat. Combined with a form of fusion, the machines have found all the energy they would ever need. There are fields...endless fields, were human beings are no longer born. We are grown. For longest time, I wouldn't belive it...and then I saw the fields with my own eyes. Watch them liquefy the dead, so they could be fed intravenously to the living. And standing there, facing the pure horrifying precision, I came to realize the obviousness of the truth. What is The Matrix? Control. The Matrix is a computer generated dream world, built to keep us under control in order to change a human being into this."},{"type":"warn","tags":["INFO"],"args":"Morpheus holds up a battery to Neo"},{"type":"warn","tags":["INFO"],"args":"Neo begins to panic."},{"type":"log","tags":["Neo"],"args":"No....I don't belive it!! It's not possible."},{"type":"log","tags":["Morpheus"],"args":"I didn't say it would be easy, Neo. I just said it would be the truth."},{"type":"log","tags":["Neo"],"args":"Noooo!! Stop!! Let me out!! I want out!!"},{"type":"warn","tags":["INFO"],"args":"His eyes snap open and he thrashes against the chair, trying to rip the cable from the back of his neck. Trinity tries to calm him down."},{"type":"log","tags":["Trinity"],"args":"Easy, Neo. Easy..."},{"type":"log","tags":["Neo"],"args":"Take this thing off me!! Take this thing.."},{"type":"log","tags":["Morpheus"],"args":"Listen to me..."},{"type":"log","tags":["Neo"],"args":"Don't touch me! Stay away from me! I don't want it, I don't believe it!!"},{"type":"warn","tags":["INFO"],"args":"Cypher rolls his eyes at Neo as he tries to get up out the chair."},{"type":"log","tags":["Cypher"],"args":"He's gonna pop."},{"type":"warn","tags":["INFO"],"args":"Neo gets up out the chair, and as he is dizzy, staggers about the room a bit, eventually falling onto the ground."},{"type":"log","tags":["Morpheus"],"args":"Breathe, Neo. Just breathe..."},{"type":"warn","tags":["INFO"],"args":"Neo throws up on the floor and passes out. He wakes up later, in his room. Morpheus is sitting beside him. Neo sits up slowly and looks at him."},{"type":"log","tags":["Neo"],"args":"I can't go back, can I?"},{"type":"log","tags":["Morpheus"],"args":"No, but if you could, would you really want to?"},{"type":"warn","tags":["INFO"],"args":"Neo isn't sure, so decides not to say anything."},{"type":"log","tags":["Morpheus"],"args":"I feel I owe you an apology. We have a rule...we never free a mind once it reaches a certain age. It's dangerous, and the mind has trouble letting go. I've seen it before, and I'm sorry. I did what I did, because...I had to."},{"type":"warn","tags":["INFO"],"args":"Neo listens"},{"type":"log","tags":["Morpheus"],"args":"When the Matrix was first built, there was a man born inside who had the ability to change whatever he wanted, to remake the Matrix as he saw fit. It was he who freed the first of us, taught us the truth: 'As long as the Matrix exists, the human race will never be free.' After he died, the Oracle prophesied his return, and that his coming would hail the destruction of the Matrix, end the war, bring freedom to our people. That is why there are those of us who have spent our entire _lives_ searching the Matrix, looking for him. I did what I did because...I belive that search is over."},{"type":"warn","tags":["INFO"],"args":"Morpheus stands up"},{"type":"log","tags":["Morpheus"],"args":"Get some rest..you're going to need it."},{"type":"log","tags":["Neo"],"args":"For what?"},{"type":"log","tags":["Morpheus"],"args":"Your training."},{"type":"warn","tags":["INFO"],"args":"As Morpheus leaves and shuts the door, Neo lies down and goes to sleep."},{"type":"warn","tags":["INFO"],"args":"In the morning, Neo is awake, sitting beside his bed. Tank comes in, and smiles at Neo."},{"type":"log","tags":["Tank"],"args":"Morning! Did you sleep?"},{"type":"warn","tags":["INFO"],"args":"Neo shakes his head"},{"type":"log","tags":["Neo"],"args":"Not much..."},{"type":"log","tags":["Tank"],"args":"You will tonight, I guarantee it! I'm Tank, I'll be your operator."},{"type":"warn","tags":["INFO"],"args":"Neo stares at his arm"},{"type":"log","tags":["Neo"],"args":"You don't...you don't have any..."},{"type":"log","tags":["Tank"],"args":"Holes? Nope. Me and my brother Dozer, we're both one hundred percent pure, old fashioned home-grown human, born free!...Right here, in the real world. Genuine child of Zion."},{"type":"log","tags":["Neo"],"args":"Zion?"},{"type":"log","tags":["Tank"],"args":"If the war was over tommorow, Zion's where the party would be."},{"type":"log","tags":["Neo"],"args":"It's a city?"},{"type":"log","tags":["Tank"],"args":"The last human city. The only place we have left."},{"type":"log","tags":["Neo"],"args":"Where is it?"},{"type":"log","tags":["Tank"],"args":"Deep underground, near the Earth's core, where it's still warm. You live long enough, you might even see it!"},{"type":"warn","tags":["INFO"],"args":"Tank smiles"},{"type":"log","tags":["Tank"],"args":"Goddamn, I...I gotta tell you, I'm fairly excited to see what you're capable of, if Morpheus is right and all...We're not supposed to talk about this, but if you are...Damn, it's a very exciting time. We got a lot to do, lets get to it.."},{"type":"warn","tags":["INFO"],"args":"Tank leads Neo onto the main deck, and plugs him in."},{"type":"log","tags":["Tank"],"args":"Now, we're supposed to start with these operation programs, that's major boring sh*t. Let's do something a little more fun...combat training."},{"type":"warn","tags":["INFO"],"args":"Tank smiles as he sits down in his operator's chair, flipping through several disks. He picks one, and puts it into his computer. Neo looks at the screen."},{"type":"log","tags":["Neo"],"args":"Jujitsu? I'm going to learn..._Jujitsu_?"},{"type":"warn","tags":["INFO"],"args":"smiling, Tank presses the 'Load' button."},{"type":"warn","tags":["INFO"],"args":"Neo's body jumps against the harness as his eyes clamp shut. The monitors kick wildly as his heart pounds, adrenaline surges, and his brain sizzles. An instant later his eyes snap open."},{"type":"log","tags":["Neo"],"args":"Holy sh*t!"},{"type":"warn","tags":["INFO"],"args":"Tank grins"},{"type":"log","tags":["Tank"],"args":"Hey Mikey, I think he likes it! How about some more?"},{"type":"log","tags":["Neo"],"args":"Hell yeah..oh yeah."},{"type":"warn","tags":["INFO"],"args":"Hours later, Morpheus walks in. Tank is blinking, trying to keep his eyes in focus."},{"type":"log","tags":["Morpheus"],"args":"How is he....?"},{"type":"log","tags":["Tank"],"args":"Ten hours straight...he's a _machine!_"},{"type":"warn","tags":["INFO"],"args":"Neo's training finishes, and he opens his eyes, breathing hard."},{"type":"log","tags":["Neo"],"args":"*gasp* I know...Kung Fu!"},{"type":"log","tags":["Morpheus"],"args":"Show me..."},{"type":"warn","tags":["INFO"],"args":"Morpheus sits down in the chair next to Neo and nods at Tank."},{"type":"warn","tags":["INFO"],"args":"They appear in in a very sparse japanese-style dojo."},{"type":"log","tags":["Morpheus"],"args":"This is a sparring program, similar to the programmed reality of the Matrix. It has the same basic rules, rules like gravity. What you must learn is that these rules are no different than the rules of a computer system...some of them can can be bent. Others...can be broken. Understand?"},{"type":"warn","tags":["INFO"],"args":"Neo thinks about it, and nods"},{"type":"log","tags":["Morpheus"],"args":"Then hit me...if you can."},{"type":"warn","tags":["INFO"],"args":"Morpheus assumes a fighting stance. Neo assumes a similar stance, cautiously circling until he gives a short cry and launches a furious attack. They move at high speed, fists and feet striking from every angle as Neo presses his attack, but each and every blow is blocked by effortless speed. Morpheus punches Neo and knocks him over."},{"type":"log","tags":["Morpheus"],"args":"Good. Adaptation...improvisation. But your weakness is not your technique."},{"type":"warn","tags":["INFO"],"args":"While their minds battle in the programmed reality, the two bodies appear quite serene, suspended in the drive chairs. Tank and Mouse monitor their life systems noticing that Neo's is wildly and chaotically lit up as opposed to the slow and steady rhythm of Morpheus. Everyone is sitting in another room. Mouse bursts in."},{"type":"log","tags":["Mouse"],"args":"Morpheus is fighting Neo!"},{"type":"warn","tags":["INFO"],"args":"All at once, they all bolt for the door to go and watch."},{"type":"warn","tags":["INFO"],"args":"Neo's fighting is gradually improving, and he almost manages to beat Morpheus when he hurls Neo across the room, and he falls. Neo lies on the floor as Morpheus casually walks up to him."},{"type":"log","tags":["Morpheus"],"args":"How did I beat you.....?"},{"type":"log","tags":["Neo"],"args":"You...you're too fast..."},{"type":"log","tags":["Morpheus"],"args":"Do you _belive_ that my being stronger or faster has anything to do with my muscles in _this_ place?"},{"type":"warn","tags":["INFO"],"args":"Neo just looks at him. Morpheus stares back."},{"type":"log","tags":["Morpheus"],"args":"You think that's _air_ you're breathing now?"},{"type":"log","tags":["Neo"],"args":"...."},{"type":"warn","tags":["INFO"],"args":"Morpheus looks surprised"},{"type":"log","tags":["Morpheus"],"args":"*shrugs* Hmm."},{"type":"warn","tags":["INFO"],"args":"Neo stands up again"},{"type":"log","tags":["Morpheus"],"args":"Again!"},{"type":"warn","tags":["INFO"],"args":"Their fists fly with pneumatic speed. Everyone is gathered behind Tank and Mouse, watching the fight. Neo is much faster now, matching Morpheus' speed and blocking all his attempts to hit Neo."},{"type":"log","tags":["Mouse"],"args":"Jesus Christ, he's fast! Take a look at his neural kinetics, they're way above normal!"},{"type":"warn","tags":["INFO"],"args":"Everyone stares"},{"type":"warn","tags":["INFO"],"args":"Morpheus and Neo stop fighting for a second."},{"type":"log","tags":["Morpheus"],"args":"What are you waiting for?! You're faster than this. Don't think you are..._know_ you are..."},{"type":"warn","tags":["INFO"],"args":"They begin fighting again, Morpheus keeps on trying to get Neo to improve"},{"type":"log","tags":["Morpheus"],"args":"Come on! Stop _trying_ to hit me and hit me!"},{"type":"warn","tags":["INFO"],"args":"Neo keeps on getting faster, and Morpheus has to continue to work harder to block his attacks. The crew are still watching them fight, with increasing admiration for Neo."},{"type":"log","tags":["Mouse"],"args":"I don't belive it..."},{"type":"warn","tags":["INFO"],"args":"Neo has Morpheus pinned against the wall, his fist an inch from Morpheus' face."},{"type":"log","tags":["Neo"],"args":"I know what you're trying to do.."},{"type":"log","tags":["Morpheus"],"args":"I'm trying to free your mind, Neo...but I can only show you the door. _You're_ the one that has to walk through it....Tank, load the jump program."},{"type":"warn","tags":["INFO"],"args":"Neo straightens as the dojo dissolves away like a curtain lifting, leaving the two men now standing on a building rooftop in a city skyline."},{"type":"warn","tags":["INFO"],"args":"Morpheus turns to Neo, his long coat flapping in the wind."},{"type":"log","tags":["Morpheus"],"args":"You have to let it all go, Neo. Fear...doubt...and disbelief. Free your mind..."},{"type":"warn","tags":["INFO"],"args":"Morpheus spins, running hard at the edge of the rooftop. And jumps. He sails through the air, his coat billowing out behind him like a cape - He somersaults once and lands on the rooftop across the street."},{"type":"log","tags":["Neo"],"args":"Woah."},{"type":"warn","tags":["INFO"],"args":"Neo looks down at the street twenty floors below, then at Morpheus an impossible fifty feet away."},{"type":"log","tags":["Neo"],"args":"Okies dokie."},{"type":"warn","tags":["INFO"],"args":"Neo takes a deep breath."},{"type":"log","tags":["Neo"],"args":"Free my mind..._no_ problem."},{"type":"warn","tags":["INFO"],"args":"On the main deck, the crew are transfixed."},{"type":"log","tags":["Mouse"],"args":"So what if he makes it?"},{"type":"log","tags":["Tank"],"args":"No one's ever made the first jump..."},{"type":"log","tags":["Mouse"],"args":"I know, I know...but what if he does?"},{"type":"log","tags":["Apoc"],"args":"He won't."},{"type":"log","tags":["Mouse"],"args":"Come on.."},{"type":"log","tags":["Trinity"],"args":"Come on...."},{"type":"warn","tags":["INFO"],"args":"Neo takes another deep breath"},{"type":"log","tags":["Neo"],"args":"All right, no problem...free my mind. Free my mind..All right."},{"type":"warn","tags":["INFO"],"args":"Neo concentrates and runs."},{"type":"warn","tags":["INFO"],"args":"Summoning every ounce of strength in his legs, Neo launches himself into the air in a single maniacal shriek - But comes up drastically short."},{"type":"warn","tags":["INFO"],"args":"His eyes widen as he plummets. Stories fly by, the ground rushing up at him, but as he hits - The ground gives way, stretching like a trapeze net."},{"type":"warn","tags":["INFO"],"args":"He bounces and flips, slowly coming to a rest, flat on his back."},{"type":"warn","tags":["INFO"],"args":"He laughs, a bit unsure, wiping the wind-blown tears from his face."},{"type":"warn","tags":["INFO"],"args":"Morpheus exits the building and helps him to his feet."},{"type":"warn","tags":["INFO"],"args":"Inside the Nebuchadnezzar, the crew are feeling kind of let down by Neo."},{"type":"log","tags":["Mouse"],"args":"Wha...what does this mean?"},{"type":"log","tags":["Switch"],"args":"It doesn't _mean_ anything..."},{"type":"log","tags":["Cypher"],"args":"Everybody falls the first time. Right, Trin?"},{"type":"warn","tags":["INFO"],"args":"But Trinity has left. Neo's eyes open as Tank eases the plug out. He tries to move and groans, cradling his ribs. While Tank helps Morpheus, Neo spits blood into his hand."},{"type":"log","tags":["Neo"],"args":"I thought it wasn't real."},{"type":"log","tags":["Morpheus"],"args":"Your mind makes it real..."},{"type":"log","tags":["Neo"],"args":"If you're killed in the Matrix...you die here?"},{"type":"log","tags":["Morpheus"],"args":"The body cannot live without the mind."},{"type":"warn","tags":["INFO"],"args":"Neo goes to his room and goes to sleep."},{"type":"warn","tags":["INFO"],"args":"In the morning, Trinity goes to his room to give him food. She sees him passed out on the bed. She sets the tray down and pulls the blanket over him. She pauses, her face close to his, then inhales lightly, breathing in the scent of him, before slowly pulling away. She gets up and walks out the door, closing it quietly."},{"type":"warn","tags":["INFO"],"args":"Outside his door, Cypher is standing with his arms folded."},{"type":"log","tags":["Cypher"],"args":"I don't remember you ever bringing _me_ dinner..."},{"type":"warn","tags":["INFO"],"args":"Trinity looks away"},{"type":"log","tags":["Cypher"],"args":"There _is_ something about him, isn't there?"},{"type":"log","tags":["Trinity"],"args":"Don't tell me you're a believer now..."},{"type":"log","tags":["Cypher"],"args":"I just keep wondering..if Morpheus is so sure, why doesn't he take him to see the Oracle?"},{"type":"log","tags":["Trinity"],"args":"Morpheus will take him...when he's ready."},{"type":"warn","tags":["INFO"],"args":"She walks away from him, and Cypher smiles to himself."},{"type":"warn","tags":["INFO"],"args":"When Neo wakes up, Morpheus takes him into another program. They walk down a busy street, full of people going to work. Morpheus casually walks through them, but Neo keeps on being hit or shoved aside. As they walk, Morpheus begins to walk."},{"type":"log","tags":["Morpheus"],"args":"The Matrix is a system, Neo. That system is our enemy. But when you're inside, you look around. What do you see? Business people, teachers, lawyers, carpenters. The very minds of the people we are trying to save. But until we do, these people are still a part of that system, and that makes them our enemy."},{"type":"warn","tags":["INFO"],"args":"A woman walks by, standing out from all the people in suits, as she is wearing a bright red dress, and bright red lipstick. Neo stares."},{"type":"log","tags":["Morpheus"],"args":"You have to understand, most of these people are not ready to be unplugged. And many of them are so inert, so hopelessly dependant on the system, that they will fight to protect it. Were you listening to me, Neo? Or were you looking at the woman in the red dress?"},{"type":"log","tags":["Neo"],"args":"I was..."},{"type":"log","tags":["Morpheus"],"args":"Look again.."},{"type":"warn","tags":["INFO"],"args":"Neo turns around, to see that the woman in the red dress has turned into an agent, and is pointing a gun at his head. Neo ducks, covering his head with his hands."},{"type":"log","tags":["Morpheus"],"args":"Freeze it."},{"type":"warn","tags":["INFO"],"args":"The people and animals around them stop, frozen."},{"type":"log","tags":["Neo"],"args":"This....this isn't the Matrix?"},{"type":"log","tags":["Morpheus"],"args":"No. It's another program, designed to teach you one thing: If you are not one of us, you are one of them."},{"type":"warn","tags":["INFO"],"args":"Neo looks at the frozen agent."},{"type":"log","tags":["Neo"],"args":"What _are_ they?"},{"type":"log","tags":["Morpheus"],"args":"Sentient programs. They can move in and out of any software still hard-wired to their system. That means that anyone we haven't unplugged is potentially an agent. Inside the Matrix, they are everyone and they are no one. We have survived by hiding from them...and by running from them. But they are the gatekeepers. They are guarding all the doors, they are holding all the keys, which means that sooner or later... _someone_ is going to have to fight them."},{"type":"log","tags":["Neo"],"args":"Someone?"},{"type":"log","tags":["Morpheus"],"args":"I won't lie to you, Neo. Every single man or woman who has stood their ground, everyone who has fought an agent has died. But where they have failed, you will suceed."},{"type":"warn","tags":["INFO"],"args":"Neo looks puzzled"},{"type":"log","tags":["Neo"],"args":"Why?"},{"type":"log","tags":["Morpheus"],"args":"I've seen an agent punch through a concrete wall. Men have emptied entire clips at them, and hit nothing but air. Yet _their_ strength and _their_ speed, are still based on a world built on rules. Because of that, they will never be as strong, or as fast, as you can be."},{"type":"log","tags":["Neo"],"args":"What are you trying to tell me? That I can...dodge bullets?"},{"type":"log","tags":["Morpheus"],"args":"No, Neo. I'm trying to tell you, that when _you're_ ready... _you_ won't have to..."},{"type":"warn","tags":["INFO"],"args":"At that moment, Morpheus' cell phone rings. He picks it up and answers."},{"type":"log","tags":["Morpheus"],"args":"Yes?"},{"type":"log","tags":["Tank"],"args":"We've got trouble."},{"type":"warn","tags":["INFO"],"args":"They both come out of the program, and move towards the main deck."},{"type":"log","tags":["Morpheus"],"args":"Did Zion send a warning?"},{"type":"log","tags":["Dozer"],"args":"No, another ship."},{"type":"warn","tags":["INFO"],"args":"The whole crew goes to the front of the ship, and sits down."},{"type":"log","tags":["Dozer"],"args":"Sh*t...squiddies sweeping in quick."},{"type":"log","tags":["Neo"],"args":"...Squiddy?"},{"type":"log","tags":["Trinity"],"args":"A sentinel. Killing machine designed for one thing."},{"type":"log","tags":["Dozer"],"args":"Search...and destroy."},{"type":"log","tags":["Morpheus"],"args":"Set her down right over there....how're we doing, Tank?"},{"type":"log","tags":["Tank"],"args":"Power offline...EMP armed and ready..."},{"type":"warn","tags":["INFO"],"args":"Neo looks at the device in Tank's hand."},{"type":"log","tags":["Neo"],"args":"EMP?"},{"type":"log","tags":["Trinity"],"args":"Electromagnetic pulse. Disables any electrical system within the blast radius. It's the only weapon we have against the machines."},{"type":"log","tags":["Neo"],"args":"Where are we?"},{"type":"log","tags":["Trinity"],"args":"There are old service and waste systems."},{"type":"log","tags":["Neo"],"args":"Sewers?"},{"type":"log","tags":["Trinity"],"args":"They used to be cities that spanned for hundreds of miles. Now these sewers are all that's left."},{"type":"log","tags":["Morpheus"],"args":"Quiet!"},{"type":"warn","tags":["INFO"],"args":"The sentinels arrive, mechanical insect like objects, flying towards their ship. One opens up, long cable-like extensions swirling about it. Then it moves off in the other direction, and the rest follow."},{"type":"warn","tags":["INFO"],"args":"The crew all sigh in relief."},{"type":"warn","tags":["INFO"],"args":"During that night, Neo gets up and goes to see Cypher, who is sitting monitoring the Matrix on monitors. Neo approaches him quietly, and when Cypher realizes he's there, he jumps out of his skin."},{"type":"log","tags":["Cypher"],"args":"Woah, Neo! You scared the bejeezus outta me."},{"type":"log","tags":["Neo"],"args":"Sorry.."},{"type":"log","tags":["Cypher"],"args":"It's okay."},{"type":"log","tags":["Neo"],"args":"Is that..."},{"type":"log","tags":["Cypher"],"args":"The Matrix? Yeah."},{"type":"log","tags":["Neo"],"args":"Do you always look at it encoded?"},{"type":"log","tags":["Cypher"],"args":"Well, you have to. The image translators work for the construct program. But there's way too much information to decode the Matrix. You get used to it...I, I don't even see the code. All _I_ see is...blond, brunette, red-head..."},{"type":"warn","tags":["INFO"],"args":"Cypher gestures towards the monitors."},{"type":"log","tags":["Cypher"],"args":"Hey, you uh...you want a drink?"},{"type":"warn","tags":["INFO"],"args":"Neo nods"},{"type":"log","tags":["Neo"],"args":"Sure."},{"type":"warn","tags":["INFO"],"args":"Cypher pours Neo a drink from a large jug. He hands it to him."},{"type":"log","tags":["Cypher"],"args":"You know, I know what you're thinking, because right now I'm thinking the same thing. Actually, I've been thinking it ever since I _got_ here....Why, oh _why_, didn't I take..the _blue_ pill."},{"type":"warn","tags":["INFO"],"args":"Neo takes a sip and it almost kills him."},{"type":"warn","tags":["INFO"],"args":"Cypher laughs"},{"type":"log","tags":["Cypher"],"args":"Good sh*t, huh? Dozer makes it. It's good for two things: degreasing engines, and...killin' brain cells."},{"type":"log","tags":["Neo"],"args":"*tries to breathe* Oh!"},{"type":"log","tags":["Cypher"],"args":"So...can I ask you something? Did he tell you why he did it?"},{"type":"warn","tags":["INFO"],"args":"Neo nods"},{"type":"warn","tags":["INFO"],"args":"Cypher whistles"},{"type":"log","tags":["Cypher"],"args":"Jee-zus! What a mind job...So, you're here to save the world...what do you _say_ to something like that?! A little piece of advice..you see an agent - you do what _we_ do. Run...you run your ass off."},{"type":"warn","tags":["INFO"],"args":"Neo swallows down the last mouthful and looks a little apprehensive."},{"type":"log","tags":["Neo"],"args":"Thanks for the drink..."},{"type":"log","tags":["Cypher"],"args":"Sweet dreams.."},{"type":"warn","tags":["INFO"],"args":"Neo walks back into his room and goes to sleep."},{"type":"warn","tags":["INFO"],"args":"We appear in a restaurant, a piece of steak is on a plate, and someone is cutting it up. We see Agent Smith sitting across from this person, and he takes his sunglasses off."},{"type":"log","tags":["Agent Smith"],"args":"So we have a deal, _Mr_ Reagan?"},{"type":"warn","tags":["INFO"],"args":"We now see the person sitting with him is Cypher. He looks at his cut up bit of steak on his fork."},{"type":"log","tags":["Cypher"],"args":"You know, I know this steak doesn't exist. I know that when I put it in my mouth, the Matrix is telling my brain..that it is juicy..and delicious."},{"type":"warn","tags":["INFO"],"args":"he sighs"},{"type":"log","tags":["Cypher"],"args":"After nine years, you know what I realize?"},{"type":"warn","tags":["INFO"],"args":"Cypher puts the bit of steak into his mouth, and sighs, as he chews it with his eyes closed."},{"type":"log","tags":["Cypher"],"args":"Ignorance is bliss."},{"type":"log","tags":["Agent Smith"],"args":"Then we have a deal?"},{"type":"log","tags":["Cypher"],"args":"I don't want to remember _nothing_. Nothing. You understand? And I wanna be rich..you know, someone important. Like an actor."},{"type":"log","tags":["Agent Smith"],"args":"Whatever you want..._Mr_ Reagan..."},{"type":"log","tags":["Cypher"],"args":"Okay. I get my body back into a power plant, re-insert me into the Matrix, I'll get you what you want."},{"type":"log","tags":["Agent Smith"],"args":"Access codes to the Zion mainframe.."},{"type":"log","tags":["Cypher"],"args":"_No_, I told you, I don't know them. I can get you the man who does."},{"type":"log","tags":["Agent Smith"],"args":"Morpheus"},{"type":"warn","tags":["INFO"],"args":"Morning comes, and Neo is served disgusting looking goop for breakfast."},{"type":"log","tags":["Tank"],"args":"Here you go, buddy. Breakfast of champions."},{"type":"warn","tags":["INFO"],"args":"He puts a bowl of it down in front of Neo, who just stares at it."},{"type":"log","tags":["Mouse"],"args":"If you close your eyes, it almost feels like you're eating runny eggs."},{"type":"log","tags":["Apoc"],"args":"Yeah, or a bowl of snot."},{"type":"log","tags":["Mouse"],"args":"You know what it really reminds me of? Tasty Wheat. Did you ever eat Tasty Wheat?"},{"type":"log","tags":["Switch"],"args":"No, but technically, neither did you."},{"type":"log","tags":["Mouse"],"args":"That's exactly my point. Exactly. Because you have to wonder now, how did the machines really know what Tasty Wheat tasted like, huh? Maybe they got it wrong. Maybe what _I_ think Tasty Wheat tasted like actually tasted like, uh..oatmeal, or tuna fish. That makes you wonder about a lot of things. You take chicken for example, maybe they couldn't figure out what to make chicken taste like, which is why chicken tastes like everything. Maybe they couldn't..."},{"type":"log","tags":["Apoc"],"args":"Shut up, Mouse."},{"type":"log","tags":["Dozer"],"args":"It's a single celled protein combined with synthetic aminos, vitamins, and minerals. Everything the body needs."},{"type":"log","tags":["Mouse"],"args":"It doesn't have _everything_ the body needs."},{"type":"warn","tags":["INFO"],"args":"He turns to Neo, who is fiddling with his food, picking it up with his spoon and dropping it back into the bowl."},{"type":"log","tags":["Mouse"],"args":"So I understand you've run through the agent training program...you, uh, you know...I wrote that program."},{"type":"warn","tags":["INFO"],"args":"Switch rolls her eyes"},{"type":"log","tags":["Apoc"],"args":"Here it comes..."},{"type":"log","tags":["Mouse"],"args":"So, uh, what did you think of her?"},{"type":"log","tags":["Neo"],"args":"Of who...?"},{"type":"log","tags":["Mouse"],"args":"The woman in the red dress! I, I designed her. She, um..well she doesn't talk very much, but...but if you'd like to meet her, I can arrange a much more personalized milieu."},{"type":"log","tags":["Switch"],"args":"Digital pimp, hard at work."},{"type":"log","tags":["Mouse"],"args":"Pay no attention these hypocrites, Neo. To deny our own impulses, is to deny the very thing that makes us human."},{"type":"warn","tags":["INFO"],"args":"Morpheus walks in."},{"type":"log","tags":["Morpheus"],"args":"Dozer, when you're done, bring the ship up to broadcast depth, we're going in. I'm taking Neo to see her."},{"type":"log","tags":["Neo"],"args":"See who?"},{"type":"log","tags":["Tank"],"args":"The Oracle...."},{"type":"warn","tags":["INFO"],"args":"Everyone gets into their chairs, and gets plugged in, as Tank sets everything up for them."},{"type":"log","tags":["Tank"],"args":"Everyone please observe, the fasten seat belt and no smoking signs have been turned on. Sit back...and enjoy your ride..."},{"type":"warn","tags":["INFO"],"args":"They arrive in a garage, next to a phone."},{"type":"warn","tags":["INFO"],"args":"Morpheus takes out a cell phone, and calls up Tank."},{"type":"log","tags":["Morpheus"],"args":"We're in...we'll be back in an hour."},{"type":"warn","tags":["INFO"],"args":"He hangs up."},{"type":"warn","tags":["INFO"],"args":"They all walk out the room, leaving Switch and Apoc waiting for them to come back. As they head towards a black car, Cypher drops a cell phone into the bin and it begins to ring."},{"type":"warn","tags":["INFO"],"args":"They get into the car, and Morpheus begins to drive them to their destination. At a red light, he turns around to look at Neo, who is sitting in the back seat with Trinity."},{"type":"log","tags":["Morpheus"],"args":"Unbeliveable....isn't it?"},{"type":"warn","tags":["INFO"],"args":"Neo looks out at the street they are driving down."},{"type":"log","tags":["Neo"],"args":"God..."},{"type":"warn","tags":["INFO"],"args":"Trinity turns to look at him"},{"type":"log","tags":["Trinity"],"args":"What?"},{"type":"warn","tags":["INFO"],"args":"Neo points to a restaurant."},{"type":"log","tags":["Neo"],"args":"I used to eat there....really good noodles."},{"type":"warn","tags":["INFO"],"args":"he stops to think about it"},{"type":"log","tags":["Neo"],"args":"I have these memories from my life..none of them happened. What does that _mean_?"},{"type":"log","tags":["Trinity"],"args":"That the Matrix cannot tell you who you are."},{"type":"log","tags":["Neo"],"args":"But an Oracle can?"},{"type":"log","tags":["Trinity"],"args":"That's different."},{"type":"log","tags":["Neo"],"args":"Did you go to her?"},{"type":"warn","tags":["INFO"],"args":"Trinity looks away from him."},{"type":"log","tags":["Trinity"],"args":"Yes."},{"type":"log","tags":["Neo"],"args":"What did she tell you?"},{"type":"warn","tags":["INFO"],"args":"Trinity smiles"},{"type":"log","tags":["Trinity"],"args":"She told me..."},{"type":"log","tags":["Neo"],"args":"What?"},{"type":"warn","tags":["INFO"],"args":"He looks confused. Just then, Morpheus stops the car."},{"type":"log","tags":["Morpheus"],"args":"We're here. Neo, come with me."},{"type":"warn","tags":["INFO"],"args":"They walk into an apartment building, and into an elevator. Morpheus is wearing his long coat and sunglasses again."},{"type":"log","tags":["Neo"],"args":"So is this the same Oracle that made the prophecy?"},{"type":"log","tags":["Morpheus"],"args":"Yes. She's very old. She's been with us since the beginning."},{"type":"log","tags":["Neo"],"args":"The beginning?"},{"type":"log","tags":["Morpheus"],"args":"Of the Resistance."},{"type":"log","tags":["Neo"],"args":"And she knows, what, everything?"},{"type":"warn","tags":["INFO"],"args":"Morpheus smiles"},{"type":"log","tags":["Morpheus"],"args":"She would say, she knows enough."},{"type":"log","tags":["Neo"],"args":"And she's _never_ wrong?"},{"type":"log","tags":["Morpheus"],"args":"Try not to think of it in terms of right and wrong..."},{"type":"warn","tags":["INFO"],"args":"They get out the elevator, and start to walk down the corrider."},{"type":"log","tags":["Morpheus"],"args":"She is a guide, Neo. She can help you to find the path."},{"type":"log","tags":["Neo"],"args":"She helped you?"},{"type":"log","tags":["Morpheus"],"args":"Yes."},{"type":"log","tags":["Neo"],"args":"What did she tell you?"},{"type":"warn","tags":["INFO"],"args":"Morpheus smiles. Neo is beginning to get a bit puzzled with this."},{"type":"log","tags":["Morpheus"],"args":"That I would find The One.."},{"type":"warn","tags":["INFO"],"args":"They arrive at the door to the Oracle's appartment. Neo waits for Morpheus to open the door. Morpheus shakes his head."},{"type":"log","tags":["Morpheus"],"args":"I told you, I can only show you the door. _You're_ the one who has to walk through it."},{"type":"warn","tags":["INFO"],"args":"Neo puts his hand on the door handle, just about to open it, when a Priestess opens the door, and smiles at him."},{"type":"log","tags":["Priestess"],"args":"Hello, Neo. You're right on time..."},{"type":"warn","tags":["INFO"],"args":"She leads him and Morpheus inside."},{"type":"log","tags":["Priestess"],"args":"Make yourself at home, Morpheus."},{"type":"warn","tags":["INFO"],"args":"Morpheus stays by the door."},{"type":"log","tags":["Priestess"],"args":"These are the other potentials...you can wait here."},{"type":"warn","tags":["INFO"],"args":"Neo looks around the room, and sees he is the only adult there. Most of the children's heads are shaved. Some are playing, others meditating, or practising their gift. Neo watches in amazement, as a little girl levitates wooden alphabet blocks. He turns around, and sees a skinny bald boy sitting on the floor, holding a spoon, which sways and twists as he bends it with his mind. Neo crosses over to him, and sits in front of him, interested. The boy looks at Neo as he picks up a spoon and tries to imitate the boy's actions. Despite his best efforts, Neo cannot make it bend."},{"type":"log","tags":["Spoon Boy"],"args":"Do not try and bend the spoon...that's impossible. _Instead_ only try to realize the truth..."},{"type":"log","tags":["Neo"],"args":"What truth?"},{"type":"log","tags":["Spoon Boy"],"args":"There is no spoon."},{"type":"log","tags":["Neo"],"args":"There is no spoon?"},{"type":"log","tags":["Spoon Boy"],"args":"Then you will see, it is not the _spoon_ that bends, it is only yourself."},{"type":"warn","tags":["INFO"],"args":"Neo gets the spoon and looks at it. This time he is able to bend it with his mind. It bends, curls round, and bends again. He is fascinated."},{"type":"warn","tags":["INFO"],"args":"Just then, the Priestess walks up behind him and he jumps."},{"type":"log","tags":["Priestess"],"args":"The Oracle will see you now."},{"type":"warn","tags":["INFO"],"args":"Neo looses concentration and the spoon stays bent."},{"type":"warn","tags":["INFO"],"args":"He smiles at the Spoon Boy and gets up."},{"type":"warn","tags":["INFO"],"args":"He walks into the nearby room, a kitchen. A woman is huddled beside the oven, peering inside through the cracked door."},{"type":"log","tags":["Oracle"],"args":"I know, you're Neo. Be right with you.."},{"type":"warn","tags":["INFO"],"args":"Neo looks around the room."},{"type":"log","tags":["Neo"],"args":"You're the Oracle?"},{"type":"log","tags":["Oracle"],"args":"Bingo..."},{"type":"warn","tags":["INFO"],"args":"she turns round to face him."},{"type":"log","tags":["Oracle"],"args":"Not quite what you were expecting, right?"},{"type":"warn","tags":["INFO"],"args":"She turns back to the oven."},{"type":"log","tags":["Oracle"],"args":"_Al_most done! Smell good, don't they?"},{"type":"warn","tags":["INFO"],"args":"Neo smiles politely and nods"},{"type":"log","tags":["Neo"],"args":"Yeah."},{"type":"log","tags":["Oracle"],"args":"I'd ask you to sit down...but you're not going to anyway. And don't worry about the vase."},{"type":"log","tags":["Neo"],"args":"What vase?"},{"type":"warn","tags":["INFO"],"args":"*crash*, Neo knocks it over."},{"type":"log","tags":["Oracle"],"args":"That vase."},{"type":"log","tags":["Neo"],"args":"I'm sorry."},{"type":"log","tags":["Oracle"],"args":"I _said_ don't worry about it. I'll get one of my kids to fix it."},{"type":"log","tags":["Neo"],"args":"How...how did you know?"},{"type":"log","tags":["Oracle"],"args":"Ohhh"},{"type":"warn","tags":["INFO"],"args":"she smiles"},{"type":"log","tags":["Oracle"],"args":"Whats really going to bake your noodle later on is, would you still have broken it if I hadn't said anything..."},{"type":"warn","tags":["INFO"],"args":"The Oracle gets up walks up to him."},{"type":"log","tags":["Oracle"],"args":"You're cuter than I thought...I can see why she likes you..."},{"type":"log","tags":["Neo"],"args":"Who?"},{"type":"log","tags":["Oracle"],"args":"Not too bright though."},{"type":"warn","tags":["INFO"],"args":"She grins at him."},{"type":"log","tags":["Oracle"],"args":"So what do you think, do you think you're the One?"},{"type":"log","tags":["Neo"],"args":"I don't know, I honestly don't know."},{"type":"warn","tags":["INFO"],"args":"The Oracle looks to the top of her door, where something is writen in Latin."},{"type":"log","tags":["Oracle"],"args":"You know what that means? It's Latin. Means 'Know Thyself'... I'm going to let you in on a little secret...Being the One is just like being in love. No one can tell you you're in love, you just know it. Through and through. Balls to bones. Well, I'd better have a look at you."},{"type":"warn","tags":["INFO"],"args":"she holds onto the side of his face with her hands"},{"type":"log","tags":["Oracle"],"args":"Open your mouth, say 'Ahhh!'"},{"type":"log","tags":["Neo"],"args":"Ahhh."},{"type":"log","tags":["Oracle"],"args":"Okay. Now _I'm_ supposed to say..'Hmm, that's interesting', but then you say..."},{"type":"log","tags":["Neo"],"args":"But...what?"},{"type":"log","tags":["Oracle"],"args":"But you already _know_ what I'm going to tell you."},{"type":"log","tags":["Neo"],"args":"I'm not The One....."},{"type":"warn","tags":["INFO"],"args":"he looks sort of disappointed"},{"type":"log","tags":["Oracle"],"args":"Sorry, kid. You got the gift, but it looks like you're waiting for something..."},{"type":"log","tags":["Neo"],"args":"What?"},{"type":"log","tags":["Oracle"],"args":"Your next life maybe, who knows? That's the way these things go."},{"type":"warn","tags":["INFO"],"args":"Neo starts laughing in an ironic manner."},{"type":"log","tags":["Neo"],"args":"Morpheus...he, he almost had me convinced..."},{"type":"log","tags":["Oracle"],"args":"Poor Morpheus...without him...we're lost."},{"type":"log","tags":["Neo"],"args":"What do you mean, without him?"},{"type":"log","tags":["Oracle"],"args":"Are you sure you want to hear this?"},{"type":"warn","tags":["INFO"],"args":"Neo nods."},{"type":"log","tags":["Oracle"],"args":"Morpheus believes in you, Neo. And no one, not even you, not even _me_, can convince him otherwise. He believes it so blindly, that he's going to sacrifice his life, to save yours."},{"type":"warn","tags":["INFO"],"args":"Neo is astounded."},{"type":"log","tags":["Neo"],"args":"What??!"},{"type":"log","tags":["Oracle"],"args":"You're going to have to make a choice. In one hand, you'll have _Morpheus'_ life..and in the other hand, you'll have your own. One of you is going to die..which one...will be up to you..."},{"type":"warn","tags":["INFO"],"args":"Neo is speechless with shock."},{"type":"log","tags":["Oracle"],"args":"I'm sorry, kiddo, I really am. You have a good soul...and I hate giving good people bad news...."},{"type":"warn","tags":["INFO"],"args":"Neo looks down."},{"type":"log","tags":["Oracle"],"args":"Oh, don't worry about it...As soon as you step outside that door, you'll start feeling better. You'll remember you don't belive in any of this fate crap...you're in control of your _own_ life...remember?"},{"type":"warn","tags":["INFO"],"args":"She holds out a tray of oatmeal cookies to Neo"},{"type":"log","tags":["Oracle"],"args":"Here, take a cookie..I promise, by the time you're done eating it, you'll feel right as rain.."},{"type":"warn","tags":["INFO"],"args":"Neo slowly reaches out and takes a cookie, then walks out the door and meets Morpheus. He puts his hand on Neo's shoulder and smiles at him."},{"type":"log","tags":["Morpheus"],"args":"What was said was for you, and you alone."},{"type":"warn","tags":["INFO"],"args":"They go back to the car, and go into the hotel."},{"type":"warn","tags":["INFO"],"args":"Back on the Nebuchadnezzar, Tank is preparing to bring them back"},{"type":"log","tags":["Tank"],"args":"They're on their way..."},{"type":"warn","tags":["INFO"],"args":"He looks at the monitors with the Matrix code on them, and suddenly something on them jumps."},{"type":"log","tags":["Tank"],"args":"What _is_ that?"},{"type":"warn","tags":["INFO"],"args":"In the hotel, they are on their way up the stairs. Neo looks at a cat as it walks past the doorway. He turns around again, and an identical looking cat"},{"type":"log","tags":["Neo"],"args":"Woah, deja vu."},{"type":"warn","tags":["INFO"],"args":"Everyone spins around to look at him."},{"type":"log","tags":["Trinity"],"args":"What did you just say?"},{"type":"log","tags":["Neo"],"args":"Nothing, uh, just had a little..deja vu."},{"type":"log","tags":["Trinity"],"args":"What did you see?"},{"type":"log","tags":["Cypher"],"args":"What happened?"},{"type":"warn","tags":["INFO"],"args":"Neo is puzzled by their interest in this."},{"type":"log","tags":["Neo"],"args":"A black cat went past us...and then another that looked just like it."},{"type":"log","tags":["Trinity"],"args":"How much like it, was it the same cat?"},{"type":"log","tags":["Neo"],"args":"*shrugs* Might have been, I'm not sure."},{"type":"log","tags":["Morpheus"],"args":"Switch, Apoc!"},{"type":"log","tags":["Neo"],"args":"What is it?"},{"type":"log","tags":["Trinity"],"args":"A deja vu is usually a glitch in the Matrix...it happens when they change something"},{"type":"warn","tags":["INFO"],"args":"Tank realises what they changed."},{"type":"log","tags":["Tank"],"args":"Oh my God..."},{"type":"warn","tags":["INFO"],"args":"Mouse is sitting in his chair in one of the hotel rooms, looking at a picture of the woman in the red dress. his cell phone rings it and he picks it up."},{"type":"log","tags":["Tank"],"args":"They cut the hard line, it's a trap, get out!!"},{"type":"warn","tags":["INFO"],"args":"Mouse scrambles to his feet, and goes to the window. He opens the curtains only to find there is no window, only a solid brick wall."},{"type":"log","tags":["Mouse"],"args":"Oh no. Oh no.."},{"type":"warn","tags":["INFO"],"args":"He opens a chest, and grabs some guns, just before the agents come in, and shoot him until he's killed."},{"type":"warn","tags":["INFO"],"args":"Meanwhile, Morpheus goes to the window, and also finds that there's a brick wall there."},{"type":"log","tags":["Cypher"],"args":"That's what we changed, it's a trap, there's no way out!!"},{"type":"log","tags":["Morpheus"],"args":"Be calm."},{"type":"warn","tags":["INFO"],"args":"He turns to Trinity."},{"type":"log","tags":["Morpheus"],"args":"Give me your phone.."},{"type":"log","tags":["Trinity"],"args":"They'll be able to track it."},{"type":"warn","tags":["INFO"],"args":"she hands it to him."},{"type":"log","tags":["Morpheus"],"args":"We have no choice."},{"type":"warn","tags":["INFO"],"args":"Tank answers straight away, still very upset from Mouse's death"},{"type":"log","tags":["Tank"],"args":"Operator."},{"type":"log","tags":["Morpheus"],"args":"Tank - Find a structural drawing of this building. Find it fast."},{"type":"log","tags":["Tank"],"args":"Got it."},{"type":"log","tags":["Morpheus"],"args":"I need the main wet wall."},{"type":"warn","tags":["INFO"],"args":"Agent Smith pauses, as he is about to make his way up the stairs with the other agents. He touches his earpiece."},{"type":"log","tags":["Agent Smith"],"args":"Eighth floor."},{"type":"log","tags":["Agent Brown"],"args":"They're on the eighth floor..."},{"type":"warn","tags":["INFO"],"args":"Morpheus and the others continue on their way."},{"type":"log","tags":["Morpheus"],"args":"Switch, straight ahead."},{"type":"log","tags":["Apoc"],"args":"Neo..."},{"type":"warn","tags":["INFO"],"args":"Apoc hands Neo a gun."},{"type":"log","tags":["Apoc"],"args":"I hope the Oracle gave you some good news..."},{"type":"log","tags":["Tank"],"args":"Another left, that's it."},{"type":"log","tags":["Morpheus"],"args":"Good."},{"type":"warn","tags":["INFO"],"args":"Tank hangs up the phone, and Morpheus puts it away."},{"type":"warn","tags":["INFO"],"args":"Cops flood the eighth floor, while Neo and the others are hiding in the walls. Dust falls, and Apoc starts to cough. He tries to hold it in, but eventually he has to cough, hard. All the cops spin around."},{"type":"log","tags":["Police"],"args":"They're in the walls! They're in the walls!"},{"type":"warn","tags":["INFO"],"args":"The police start to shoot at the wall, as Neo, who has never used a gun before, tries to shoot, flinching every time he fires a shot. Agent Smith takes over the body of one of the cops, and reaches through the wall, grabbing Neo by the neck."},{"type":"log","tags":["Cypher"],"args":"It's an agent!"},{"type":"warn","tags":["INFO"],"args":"With a cry, Morpheus punches his head through the wall, freeing Neo from Agent Smith's grasp. He comes out on the other side, and attacks Agent Smith."},{"type":"log","tags":["Trinity"],"args":"Morpheus!"},{"type":"log","tags":["Morpheus"],"args":"You must get Neo out! He's all that matters!"},{"type":"log","tags":["Neo"],"args":"No! No, Morpheus! Don't!"},{"type":"log","tags":["Morpheus"],"args":"Trinity, go!"},{"type":"log","tags":["Trinity"],"args":"Go!"},{"type":"warn","tags":["INFO"],"args":"She begins to shove people down. As she tries to tear Neo away he yells."},{"type":"log","tags":["Neo"],"args":"We can't leave him!"},{"type":"log","tags":["Trinity"],"args":"We have to!"},{"type":"warn","tags":["INFO"],"args":"She pulls him down, as they all go sliding down, and come out in a street outside. There are cops surrounding them, as they drop smoke bombs, and one by one, they go down the manhole. Cypher is the last to go, hesitating, as the cops aim their guns at him."},{"type":"log","tags":["Trinity"],"args":"Cypher! Come on!"},{"type":"warn","tags":["INFO"],"args":"She has to give up and leave him, as she goes down the manhole."},{"type":"warn","tags":["INFO"],"args":"Back in the hotel, Agent Smith turns to Morpheus..."},{"type":"log","tags":["Agent Smith"],"args":"The great Morpheus...we meet at last."},{"type":"log","tags":["Morpheus"],"args":"And you are?"},{"type":"log","tags":["Agent Smith"],"args":"A Smith. Agent Smith."},{"type":"warn","tags":["INFO"],"args":"Morpheus growls"},{"type":"log","tags":["Morpheus"],"args":"You all look the same to me..."},{"type":"warn","tags":["INFO"],"args":"They begin to fight, as Agent Smith easily beats him, smashing him into the walls, until he is barely alive."},{"type":"warn","tags":["INFO"],"args":"Agent Smith nods to the cops, who rush into the room."},{"type":"log","tags":["Agent Smith"],"args":"Take him..."},{"type":"warn","tags":["INFO"],"args":"Tank is watching this whole thing happening, back on the Nebuchadnezzar, and can't do a thing about it."},{"type":"log","tags":["Tank"],"args":"No..."},{"type":"warn","tags":["INFO"],"args":"He gets an incoming call, and answers it."},{"type":"log","tags":["Tank"],"args":"Operator."},{"type":"log","tags":["Cypher"],"args":"Yeah, I need an exit, fast!"},{"type":"log","tags":["Tank"],"args":"_Cypher_?!"},{"type":"log","tags":["Cypher"],"args":"Yeah! There was an accident! God damn, a car accident. All of a sudden, boom! Somebody up there still likes me."},{"type":"log","tags":["Tank"],"args":"Gotcha."},{"type":"log","tags":["Cypher"],"args":"Get me out of here fast!"},{"type":"log","tags":["Tank"],"args":"Intersection of Franklin and Erie, an old TV repair shop."},{"type":"log","tags":["Cypher"],"args":"Right."},{"type":"warn","tags":["INFO"],"args":"Cypher hangs up the phone."},{"type":"warn","tags":["INFO"],"args":"Trinity, Neo etc are walking down the street, Trinity gets out her phone and calls Tank."},{"type":"log","tags":["Trinity"],"args":"Tank, it's me."},{"type":"log","tags":["Neo"],"args":"Is Morpheus alive?"},{"type":"log","tags":["Trinity"],"args":"Tank, is Morpheus alive?"},{"type":"log","tags":["Tank"],"args":"Yeah, and they're moving him. I don't know where to yet."},{"type":"warn","tags":["INFO"],"args":"Trinity turns to Neo."},{"type":"log","tags":["Trinity"],"args":"He's alive."},{"type":"warn","tags":["INFO"],"args":"She turns away from him again."},{"type":"log","tags":["Trinity"],"args":"We need an exit."},{"type":"log","tags":["Tank"],"args":"You're not far from Cypher."},{"type":"log","tags":["Trinity"],"args":"_Cypher_?"},{"type":"log","tags":["Tank"],"args":"Yeah, I know. He's at Franklin and Erie."},{"type":"log","tags":["Trinity"],"args":"Got it."},{"type":"warn","tags":["INFO"],"args":"Trinity hangs up the phone."},{"type":"warn","tags":["INFO"],"args":"Tank gets Cypher out, and as he comes back to the real word, he grimaces."},{"type":"log","tags":["Tank"],"args":"Got him."},{"type":"warn","tags":["INFO"],"args":"Cypher stands up and walks towards Tank and the controls."},{"type":"log","tags":["Cypher"],"args":"Where are they?"},{"type":"log","tags":["Tank"],"args":"Making the call."},{"type":"log","tags":["Cypher"],"args":"Good..."},{"type":"warn","tags":["INFO"],"args":"Neo etc arrive at Franklin and Erie, and the phone rings."},{"type":"log","tags":["Trinity"],"args":"You first, Neo."},{"type":"warn","tags":["INFO"],"args":"Back at the Nebuchadnezzar, Cypher gets a gun and shoots Tank, knocking him out. Dozer stands up, as he thinks Tank is dead, and runs towards Cypher."},{"type":"log","tags":["Dozer"],"args":"Noooo!"},{"type":"warn","tags":["INFO"],"args":"Cypher shoots Dozer, and he dies."},{"type":"warn","tags":["INFO"],"args":"Cypher gets into the operator's chair, and puts on the headset."},{"type":"warn","tags":["INFO"],"args":"Neo goes to lift the phone, and it suddenly cuts off. Trinity looks at him."},{"type":"log","tags":["Neo"],"args":"I don't know, it just went dead."},{"type":"warn","tags":["INFO"],"args":"Trinity gets out her cellular phone, and calls the operator. Cypher picks up."},{"type":"log","tags":["Cypher"],"args":"Hello, Trinity..."},{"type":"log","tags":["Trinity"],"args":"Cypher? Where's Tank?"},{"type":"warn","tags":["INFO"],"args":"Cypher goes to her body and moves up close to her face, staring at her. He speaks into the headset."},{"type":"log","tags":["Cypher"],"args":"You know, for a long time, I thought I was...in love with you...I used to dream about you...you're a beautiful woman, Trinity. Too bad things had to turn out this way..."},{"type":"log","tags":["Trinity"],"args":"You killed them!"},{"type":"log","tags":["Apoc"],"args":"What?!"},{"type":"log","tags":["Cypher"],"args":"I'm tired, Trinity. I'm tired of this war. I'm tired of fighting. I'm tired of this ship, being cold, eating the same god damn goop every day. But most of all, I'm tired of that jack-off and all his bullsh*t."},{"type":"warn","tags":["INFO"],"args":"He jumps onto Morpheus' body"},{"type":"log","tags":["Cypher"],"args":"Well, surprise, ass-hole! I bet you never saw _this_ coming, did ya? God, I wish I could be there, when they break you. I wish I could walk in just when it happens. So right then, you'd know it was _me_."},{"type":"log","tags":["Trinity"],"args":"You gave them _Morpheus_...."},{"type":"log","tags":["Cypher"],"args":"He _lied_ to us, Trinity. He tricked us. If you'd have told us the truth, _we_ woulda told you to shove that red pill right up your ass!"},{"type":"log","tags":["Trinity"],"args":"That's not true Cypher, he set us _free_."},{"type":"log","tags":["Cypher"],"args":"Free? You call _this_, free? All I do is what he tells me to do. If I had to choose between that, and The Matrix, well, I, I choose the _Matrix_."},{"type":"log","tags":["Trinity"],"args":"The Matrix isn't real!"},{"type":"log","tags":["Cypher"],"args":"I disagree, Trinity. I _think_ that the Matrix can be more real than this world. All I do is pull the plug here. But there, you have to watch Apoc die. his hand reaches towards Apoc's plug."},{"type":"log","tags":["Apoc"],"args":"Trinity..."},{"type":"warn","tags":["INFO"],"args":"Cypher pulls the plug, and Apoc collapses and dies."},{"type":"log","tags":["Switch"],"args":"No!"},{"type":"warn","tags":["INFO"],"args":"Cypher starts talking on the cellular to Trinity again."},{"type":"log","tags":["Cypher"],"args":"Welcome to the real world, huh baby?"},{"type":"log","tags":["Trinity"],"args":"But you're out, Cypher, you can't _go_ back."},{"type":"log","tags":["Cypher"],"args":"Oh no. That's what _you_ think. They're going to reinsert my body. I go back to sleep, and when I wake up, I won't remember a god damn thing. By the way, if you have anything terribly important to say to Switch, I suggest you say it now..."},{"type":"log","tags":["Trinity"],"args":"No, please don't..."},{"type":"warn","tags":["INFO"],"args":"Switch is crying, leaning over Apoc's body."},{"type":"log","tags":["Switch"],"args":"Not like this...not like this..."},{"type":"warn","tags":["INFO"],"args":"Cypher pulls her plug, and Switch goes limp, collapses, and dies."},{"type":"warn","tags":["INFO"],"args":"Trinity is stunned, and looks like she's about to cry."},{"type":"log","tags":["Cypher"],"args":"Too late..."},{"type":"log","tags":["Trinity"],"args":"God damn you, Cypher!"},{"type":"log","tags":["Cypher"],"args":"Don't hate me Trinity...I'm just a messenger, and right now I'm gonna prove it to you. If Morpheus was right, then there's no way I can pull this plug. I mean, if _Neo's_ The One, then there'd have to be some kinda _miracle_ to stop me. I mean.. how can he be the _One_..if he's _dead_? You never did answer me before, if you bought into Morpheus' bullsh*t...come on! All I want is a little yes or a no! Look into his eyes, those big pretty eyes. Tell me..._Yes_ or _No_?"},{"type":"warn","tags":["INFO"],"args":"Trinity looks at Neo, who is standing in the corner looking a bit lost."},{"type":"warn","tags":["INFO"],"args":"Trinity whispers to Cypher on the cell phone."},{"type":"log","tags":["Trinity"],"args":"...Yes..."},{"type":"log","tags":["Cypher"],"args":"NO!"},{"type":"warn","tags":["INFO"],"args":"Unknown to Cypher, Tank is not dead, and gets up and finds a rifle."},{"type":"warn","tags":["INFO"],"args":"Cypher is still on the phone to Trinity"},{"type":"log","tags":["Cypher"],"args":"I don't belive it!"},{"type":"warn","tags":["INFO"],"args":"Tank comes up behind him and shoots him."},{"type":"log","tags":["Tank"],"args":"Belive it or not, you piece of sh*t, you're still gonna burn.."},{"type":"warn","tags":["INFO"],"args":"Cypher dies, unknown to Trinity, and the cell phone goes dead."},{"type":"warn","tags":["INFO"],"args":"Trinity turns to look at Neo, who doesn't know what's going on either."},{"type":"warn","tags":["INFO"],"args":"The phone starts to ring again. Everyone jumps."},{"type":"log","tags":["Neo"],"args":"You first.."},{"type":"warn","tags":["INFO"],"args":"Trinity picks up the phone, and wakes up on the Nebuchadnezzar."},{"type":"warn","tags":["INFO"],"args":"Tank helps her up, as she notices he has a large wound on his chest."},{"type":"log","tags":["Trinity"],"args":"You're hurt.."},{"type":"log","tags":["Tank"],"args":"I'll be alright."},{"type":"log","tags":["Trinity"],"args":"Dozer?"},{"type":"warn","tags":["INFO"],"args":"Tank shakes his head, and Trinity hugs him."},{"type":"warn","tags":["INFO"],"args":"Morpheus is in the office on the top floor of Loco, with 3 agents. He is handcuffed to the chair he's sitting on, and is pumped full of serum, alternately shivering and sweating. He is hooked up to various monitors with white disk electrodes."},{"type":"log","tags":["Agent Smith"],"args":"Have you ever stood and...stared at it? _marvelled_ at its beauty? Billions of people, just...living out their lives.. oblivious. Did you know that the first Matrix was designed to be a perfect human world? Where none _suffered_, where everyone would be.._happy_. It was a disaster. No one would accept the program, entire crops were lost. Some belived that we lacked the programming language to _describe_ your perfect world...But _I_ belive, that as a species, human beings define their reality though _misery_ and suffering. Which is why the Matrix was redesigned to _this_, the peak of your civilization. I say _your_ civilization, because as soon as we started thinking _for_ you, it really became _our_ civilization, which is, of course, what this all about.... Evolution, Morpheus, evolution..like the _dinosaur_. Look out that window...you had your time. The future is our world, Morpheus, the future...is _our_ time."},{"type":"warn","tags":["INFO"],"args":"Agent Jones walks in."},{"type":"log","tags":["Agent Jones"],"args":"There could be a problem.."},{"type":"warn","tags":["INFO"],"args":"On the Nebuchadnezzar, Tank, Neo and Trinity are standing over Morpheus' body, looking at his life monitor."},{"type":"log","tags":["Neo"],"args":"What are they doing to him?"},{"type":"log","tags":["Tank"],"args":"Breaking into his mind. It's like hacking into a computer, all it takes is time.."},{"type":"log","tags":["Neo"],"args":"How much time?"},{"type":"log","tags":["Tank"],"args":"Depends on the mind. Eventually, it will crack and his alpha patterns will change from this...."},{"type":"warn","tags":["INFO"],"args":"Tank punches a button on the screen."},{"type":"log","tags":["Tank"],"args":"To this..When it does, Morpheus will tell them anything they want to know."},{"type":"log","tags":["Neo"],"args":"Well, what _do_ they want?"},{"type":"log","tags":["Tank"],"args":"The leader of every ship is given codes to Zion's mainframe computer. If an agent got the codes and got into Zion's _mainframe_...it could destroy us. We can't let that happen."},{"type":"log","tags":["Tank"],"args":"Trinity? Zion's more important than me, or you, or even _Morpheus_."},{"type":"log","tags":["Neo"],"args":"Well there has to be _something_ we can do.."},{"type":"log","tags":["Tank"],"args":"There is..."},{"type":"warn","tags":["INFO"],"args":"Tank looks grim."},{"type":"log","tags":["Tank"],"args":"....We pull the plug."},{"type":"log","tags":["Trinity"],"args":"You're going to _kill_ him? _KILL_ Morpheus?!"},{"type":"log","tags":["Tank"],"args":"We don't have any other choice..."},{"type":"warn","tags":["INFO"],"args":"Back in the office, the agents have found out Cypher is dead, and are looking for a solution."},{"type":"log","tags":["Agent Smith"],"args":"Never send a _human_ to do a machine's job..."},{"type":"log","tags":["Agent Brown"],"args":"If indeed the insider has failed, they'll sever the connection as soon as possible, unless..."},{"type":"log","tags":["Agent Jones"],"args":"They're dead in either case..."},{"type":"log","tags":["Agent Smith"],"args":"We have no choice but to continue as planned, deploy the sentinels. Immediatly."},{"type":"warn","tags":["INFO"],"args":"On the Nebuchadnezzar, they are getting ready to pull Morpheus' plug..Neo looks horrifed."},{"type":"log","tags":["Tank"],"args":"Morpheus, you're more than a leader to us, you're...a father. We'll miss you always...."},{"type":"warn","tags":["INFO"],"args":"As his hand goes to Morpheus' plug, Neo says in a quiet voice."},{"type":"log","tags":["Neo"],"args":"Stop..."},{"type":"warn","tags":["INFO"],"args":"Trinity and Tank spin around to face him."},{"type":"log","tags":["Neo"],"args":"I don't belive this is happening!"},{"type":"log","tags":["Tank"],"args":"Neo, this has to be done.."},{"type":"log","tags":["Neo"],"args":"_does_ it? I...I don't know! I...this can't be just coincidence. It can't be."},{"type":"log","tags":["Tank"],"args":"What are you talking about?"},{"type":"log","tags":["Neo"],"args":"The...The Oracle, she told me this would happen. She told me that I would have to make a choice."},{"type":"log","tags":["Trinity"],"args":"What choice?"},{"type":"warn","tags":["INFO"],"args":"Neo starts to walk away from them, towards his chair."},{"type":"log","tags":["Trinity"],"args":"What are you doing?"},{"type":"log","tags":["Neo"],"args":"I'm going in."},{"type":"log","tags":["Trinity"],"args":"No you're not."},{"type":"log","tags":["Neo"],"args":"I have to."},{"type":"log","tags":["Trinity"],"args":"Neo, Morpheus sacrificed _himself_, so that he could get you out. There's no way that you're going back in."},{"type":"log","tags":["Neo"],"args":"Morpheus did what he did because he belived I'm something I'm not."},{"type":"log","tags":["Trinity"],"args":"What?!"},{"type":"log","tags":["Neo"],"args":"I'm not the one, Trinity. The Oracle hit me with that too."},{"type":"log","tags":["Trinity"],"args":"No. You have to be."},{"type":"log","tags":["Neo"],"args":"I'm not, I'm sorry. I'm just another guy."},{"type":"log","tags":["Trinity"],"args":"No Neo, that's not true..it can't be true."},{"type":"log","tags":["Neo"],"args":"Why?"},{"type":"warn","tags":["INFO"],"args":"Trinity just looks away."},{"type":"log","tags":["Tank"],"args":"Neo, this is Loco! They've got Morpheus in a _military controlled building_. Even _if_ you somehow got inside, those are _agents_ holding him! Three of 'em! I want Morpheus back too, but what you're talking about is _suicide_!"},{"type":"log","tags":["Neo"],"args":"I know that's what it looks like, but it's not. I can't explain to you _why_ it's not. Morpheus belived something, and he was ready to give his life for what he belived. I understand that now! That's why I have to go."},{"type":"log","tags":["Tank"],"args":"Why?"},{"type":"warn","tags":["INFO"],"args":"Neo starts to set up his monitor."},{"type":"log","tags":["Neo"],"args":"Because I believe in something."},{"type":"log","tags":["Trinity"],"args":"What?"},{"type":"log","tags":["Neo"],"args":"I believe I can bring him back..."},{"type":"warn","tags":["INFO"],"args":"He stars to wire himself up. So does Trinity."},{"type":"log","tags":["Neo"],"args":"What are you doing?!"},{"type":"log","tags":["Trinity"],"args":"I'm going with you."},{"type":"log","tags":["Neo"],"args":"_No_, you're not!"},{"type":"warn","tags":["INFO"],"args":"Trinity turns to face him."},{"type":"log","tags":["Trinity"],"args":"_NO_? Let me tell you what _I_ believe. I believe Morpheus means more to me than he does to you. I believe that if you are really serious about saving him, you are going to need _my_ help. And since I _am_ the ranking officer on this ship, _if_ you don't like it, I believe you can go to hell. Because you're not going anywhere else. Tank? Load us up."},{"type":"warn","tags":["INFO"],"args":"Agent Smith is still questioning Morpheus"},{"type":"log","tags":["Agent Smith"],"args":"I'd like to share a...revelation I had, during my time here. It came to me when I tried to...classify your species. I realized that you're not _actually_ mammals. Every mammal on this planet instinctively develops a natural equilibrium with the surrounding environment but...you humans do _not_. You move to an area..._and_ you _multiply_...until every natural resource is _consumed_. The only way you can survive is to.. spread to _another_ area. There is another organism on this planet that follows the same pattern. Do you know what it is? A virus. Humans beings are a _disease_, a _cancer_ of this planet...and _we_...are the cure."},{"type":"warn","tags":["INFO"],"args":"Neo and Trinity have been loaded into the construct program, wearing boots, trenchcoats and sunglasses. Neo gets out his cell phone and talks to Tank."},{"type":"log","tags":["Tank"],"args":"'kay..so what do you need..?...Besides a miracle.."},{"type":"warn","tags":["INFO"],"args":"Neo thinks about it."},{"type":"log","tags":["Neo"],"args":"Guns...lots of guns."},{"type":"warn","tags":["INFO"],"args":"As he says this, hundreds of rows of assorted rifles appear, whooshing by Neo and Trinity as they stand in the centre."},{"type":"warn","tags":["INFO"],"args":"Neo picks out a gun."},{"type":"log","tags":["Trinity"],"args":"Neo, no one has ever done anything like this."},{"type":"warn","tags":["INFO"],"args":"Neo turns to look at her, holding the gun."},{"type":"log","tags":["Neo"],"args":"That's why it's going to work."},{"type":"warn","tags":["INFO"],"args":"He loads the gun."},{"type":"warn","tags":["INFO"],"args":"Agent Smith is back at the window of the office, staring out into the world."},{"type":"warn","tags":["INFO"],"args":"He turns to Agent Brown."},{"type":"log","tags":["Agent Smith"],"args":"Why isn't the serum working?"},{"type":"log","tags":["Agent Brown"],"args":"Perhaps we're asking the wrong questions..."},{"type":"log","tags":["Agent Smith"],"args":"Leave me with him!"},{"type":"warn","tags":["INFO"],"args":"Agent Brown and Agent Jones look at each other, surprised."},{"type":"log","tags":["Agent Smith"],"args":"Now!"},{"type":"warn","tags":["INFO"],"args":"They hurriedly leave."},{"type":"warn","tags":["INFO"],"args":"Tank is mopping Morpheus' forehead with a damp cloth."},{"type":"log","tags":["Tank"],"args":"Hold on, Morpheus...They're coming for you. They're coming."},{"type":"warn","tags":["INFO"],"args":"Agent Smith grabs Morpheus' head with his hands."},{"type":"log","tags":["Agent Smith"],"args":"Can you _hear_ me, Morpheus? I'm going to be honest with you.. I hate this place...this..zoo, this..prison, this...reality.. whatever you want to call it. I can't stand it any longer. ...It's the _smell_. If there is such a thing...I feel... _saturated_ by it. I can...taste, your _stink_. And every time I do, I feel I have somehow been..infected by it, it's repulsive. I must get _out_ of here. I must get _free_...and in this mind...is the key."},{"type":"warn","tags":["INFO"],"args":"He taps Morpheus' head."},{"type":"log","tags":["Agent Smith"],"args":"My key...once Zion is destroyed there is no need for me to be here, don't you understand? I need the codes..I have to get, _inside_ Zion, and _you_ have to tell me _how_. You are going to tell me, or...you are going to die..."},{"type":"warn","tags":["INFO"],"args":"Neo and Trinity walk into the lobby of the Loco building, wearing trench coats, leather, and sunglasses."},{"type":"warn","tags":["INFO"],"args":"Trinity is carrying a hold-all. Neo walks towards the man beside the metal detecting thingy he has to walk though."},{"type":"warn","tags":["INFO"],"args":"He puts the bag through, and then walks through himself. The alarms go off."},{"type":"log","tags":["Guard"],"args":"Please remove any metallic items you are carrying, keys, loose change..."},{"type":"warn","tags":["INFO"],"args":"Neo opens his trench coat, showing his clothes are lined with guns. He just looks at the guard."},{"type":"log","tags":["Guard"],"args":"Holy Sh*t!!!"},{"type":"warn","tags":["INFO"],"args":"Neo and Trinity pull out guns, and kill everyone in the room, but not before the last guard sends for backup."},{"type":"log","tags":["Guard"],"args":"Backup! Send backup!"},{"type":"warn","tags":["INFO"],"args":"Trinity shoots him."},{"type":"warn","tags":["INFO"],"args":"They move into the main lobby of the hotel, dropping their empty guns and pulling out new ones."},{"type":"warn","tags":["INFO"],"args":"As they walk towards the elevator, backup arrives."},{"type":"warn","tags":["INFO"],"args":"A whole bunch of guards run in, aiming their rifles at Neo and Trinity."},{"type":"log","tags":["Guard 2"],"args":"Freeze!!"},{"type":"warn","tags":["INFO"],"args":"Neo and Trinity look at each other, and then dart to opposite ends of the room, and within the space of 5 minutes, manage to wipe out every man in the room."},{"type":"warn","tags":["INFO"],"args":"They continue to walk to the elevator, without a word, press the button, and get in. They leave the main lobby in pieces, literally, as pieces of the wall start to fall down."},{"type":"warn","tags":["INFO"],"args":"Agent Brown and Agent Jones walk back into the office where Agent Smith is 'questioning' Morpheus."},{"type":"log","tags":["Agent Jones"],"args":"What were you doing?!"},{"type":"log","tags":["Agent Brown"],"args":"He doesn't know..."},{"type":"log","tags":["Agent Smith"],"args":"Know what?"},{"type":"warn","tags":["INFO"],"args":"Agent Smith plugs his earpiece back in, and looks at the other two agents."},{"type":"warn","tags":["INFO"],"args":"Agent Jones turns to Morpheus, who is barely aware of his situation."},{"type":"log","tags":["Agent Jones"],"args":"I think they're trying to save you..."},{"type":"warn","tags":["INFO"],"args":"In the elevator, Trinity opens up the bag she has been carrying, and wires plastique and napalm bomb. Neo hits the emergency stop. He pulls down part of the false ceiling and finds the elevator shaft access panel. Neo ratchets down a clamp onto the elevator cable. Both of them lock on, holding on to one another. He looks up the long, dark throat of the building and takes a deep breath."},{"type":"log","tags":["Neo"],"args":"There is no spoon..."},{"type":"warn","tags":["INFO"],"args":"Neo whips out his gun and presses it to the cable, lower than where they attached themselves. The cable snaps. The counter-weights plummet, yanking Trinity and Neo up through the shaft as the elevator falls away beneath them, distending space, filling it with the sound of whistling metal, as they soar to the top. The elevator hits the bottom, and the massive explosion blows open the doors, and fire clouds engulf the elevator section of the lobby."},{"type":"warn","tags":["INFO"],"args":"The smoke alarm kicks in, and water sprays start, soaking the agents and Morpheus in the office."},{"type":"log","tags":["Agent Smith"],"args":"Find them and destroy them!"},{"type":"warn","tags":["INFO"],"args":"Trinity and Neo are up on the rooftop, attacking the various soldiers and guards placed there. They have Guns and knives, like extensions of their bodies used with the same deadly precision as their feet and their fists. Across the roof, the pilot inside the army helicopter watches the ferocious onslaught."},{"type":"log","tags":["Pilot"],"args":"I repeat, we are under attack!"},{"type":"warn","tags":["INFO"],"args":"As we watch him, the Pilot's whole body dissolves, consumed by a swarm of static as Agent Jones takes over his body. Just as she kills the last solider, Trinity sees what's coming. She stares towards the helicopter, as Agent Jones walks out. Neo looks at her, and from the fear in his face knows what's behind him."},{"type":"warn","tags":["INFO"],"args":"He whirls round, firing his guns at thought speed, each bullet missing Agent Jones, as he dodges them, blurred with motion. Neo stops firing as his guns are empty. He yells..."},{"type":"log","tags":["Neo"],"args":"Trinity!...."},{"type":"warn","tags":["INFO"],"args":"Agent Jones loads his gun."},{"type":"log","tags":["Neo"],"args":"....help!"},{"type":"warn","tags":["INFO"],"args":"Agent Jones fires as we enter the liquid space of bullet time. We are watching in slow motion as he fires, and the air sizzles, while Neo bends backwards, twisting and ducking just underneath them."},{"type":"warn","tags":["INFO"],"args":"Agent Jones fires again, as Neo bends impossibly back, one hand on the ground. The bullet grazes his thigh, leaving a red groove."},{"type":"warn","tags":["INFO"],"args":"He screams and falls backwards."},{"type":"warn","tags":["INFO"],"args":"As he lies there, Agent Jones aims his gun at Neo one last time."},{"type":"log","tags":["Agent Jones"],"args":"Only human..."},{"type":"warn","tags":["INFO"],"args":"Trinity comes up quietly behind him, and before he knows it, she has her rifle pointed against his head."},{"type":"log","tags":["Trinity"],"args":"Dodge this!"},{"type":"warn","tags":["INFO"],"args":"She shoots him, as Agent Jones falls slowly backwards, and turns back into the pilot."},{"type":"warn","tags":["INFO"],"args":"Trinity reaches out a hand, and helps Neo up. She looks at him curiously."},{"type":"log","tags":["Trinity"],"args":"How did you do that?"},{"type":"log","tags":["Neo"],"args":"Do what...?"},{"type":"log","tags":["Trinity"],"args":"You moved like they do...I've never seen anyone move that fast."},{"type":"warn","tags":["INFO"],"args":"Neo looks at the wound in his side."},{"type":"log","tags":["Neo"],"args":"Wasn't fast enough..."},{"type":"warn","tags":["INFO"],"args":"He looks over the roof, and his eyes focus on the helicopter."},{"type":"log","tags":["Neo"],"args":"Can you fly that thing?"},{"type":"log","tags":["Trinity"],"args":"...Not yet."},{"type":"warn","tags":["INFO"],"args":"She takes out a cellular phone, and calls Tank, who is back at the controls."},{"type":"log","tags":["Tank"],"args":"Operator."},{"type":"log","tags":["Trinity"],"args":"Tank, I need a program for a V-212 helicopter...Hurry!"},{"type":"warn","tags":["INFO"],"args":"Tank finds one, and presses load. Trinity's eyes flicker with REM for a few moments, and then snap open."},{"type":"log","tags":["Trinity"],"args":"Lets go."},{"type":"warn","tags":["INFO"],"args":"Over the rushing water, and the alarms, Agent Smith (still in the office) hears a sound, and suddenly realises the seriousness of the attack. He turns to the wall of windows, as the helicopter comes into view. Neo is in the back bay, aiming the mounted .50 machine gun, straight at him."},{"type":"warn","tags":["INFO"],"args":"Agent Smith twists his face into a grimace."},{"type":"log","tags":["Agent Smith"],"args":"NO...."},{"type":"warn","tags":["INFO"],"args":"Neo fires, and bullets explode through the windows in a cacophony of crashing glass, as the Agents reach for their weapons. But Neo is too close, the machine gun too fast, and bullets are everywhere, perforating the room. Agent Smith is hit first, his body falling back. Then Agent Jones, his gun still firing as his body falls. And finally Agent Jones. Neo stares at Morpheus, as if trying to will him into action."},{"type":"log","tags":["Morpheus"],"args":"Morpheus, get up! Get up, get up!"},{"type":"warn","tags":["INFO"],"args":"With tremendous effort, Morpheus regains control and yells out as he strains the handcuffs, and finally snaps them in two. He pulls the wires from his head, and stands up. He looks towards Neo, and starts to move towards the window. The Agents take over the bodies of the guards outside, and knife their way back into the room. They fire, as Morpheus reaches the window, hitting his leg as he jumps for it out of the window."},{"type":"log","tags":["Neo"],"args":"He's not going to make it!"},{"type":"warn","tags":["INFO"],"args":"Neo jumps from the helicopter, grabbing onto Morpheus just before he falls, and holds onto him as they fall until the rope ends and goes taught. Neo keeps a hold of Morpheus' arm."},{"type":"log","tags":["Neo"],"args":"Gotcha!"},{"type":"warn","tags":["INFO"],"args":"Trinity is already pulling the helicopter up and away from Loco. But Agent Smith grabs the gun from the nearest soldier, and targets the helicopter, hitting the fuel tank. The rear hull is punched full of holes."},{"type":"log","tags":["Trinity"],"args":"Sh*t!"},{"type":"warn","tags":["INFO"],"args":"Neo is pulling Morpheus up to him, when he hears the engine begin to die. Trinity guides the helicopter towards the roof of the nearest building, as Morpheus drops, landing safely on the roof. Neo soon follows, rolling free as the rope goes slack. Neo is about to detach himself, when he realises Trinity is still in helicopter. As the helicopter begins to fall, Neo swings the rope, as it begins to pull him fast along the roof."},{"type":"warn","tags":["INFO"],"args":"Trinity gets out her gun and snaps the rope inside the helicopter, grabbing onto it as she swings out of the helicopter, held up by Neo, who is standing at the very edge of the building, almost falling off. He swings her out of the way of the helicopter, as it crashes into the glass windows of the opposite building, creating a huge ripple as all the glass blows out of the windows, and Trinity just misses it, as the helicopter explodes into flames, and she bangs into a lower window of the building Neo is on."},{"type":"warn","tags":["INFO"],"args":"Tank stares at his Matrix monitor, his mouth agape."},{"type":"log","tags":["Tank"],"args":"I knew it! He's the one..."},{"type":"warn","tags":["INFO"],"args":"Neo pulls Trinity up into his arms. They both shake as they recover from the shock of what nearly happened."},{"type":"warn","tags":["INFO"],"args":"Morpheus looks at Trinity"},{"type":"log","tags":["Morpheus"],"args":"Do you belive it _now_, Trinity?"},{"type":"log","tags":["Neo"],"args":"Morpheus...The Oracle, she told me, I'm..."},{"type":"log","tags":["Morpheus"],"args":"She told you _exactly_ what you needed to hear..that's all. Neo, sooner or later, you're going to realize, just as I did, that there's a different between _knowing_ the path...and _walking_ the path..."},{"type":"warn","tags":["INFO"],"args":"The phone rings, and Tank answers"},{"type":"log","tags":["Tank"],"args":"...Operator?"},{"type":"log","tags":["Morpheus"],"args":"Tank."},{"type":"warn","tags":["INFO"],"args":"Tank grins"},{"type":"log","tags":["Tank"],"args":"Goddamn, it's good to hear your voice sir!"},{"type":"log","tags":["Morpheus"],"args":"We need an exit..."},{"type":"log","tags":["Tank"],"args":"Got one ready! Subway station, State and Balboa."},{"type":"warn","tags":["INFO"],"args":"The agents exit the office and move onto the roof."},{"type":"log","tags":["Agent Smith"],"args":"Damn it!"},{"type":"log","tags":["Agent Brown"],"args":"The trace was completed..."},{"type":"log","tags":["Agent Jones"],"args":"We have their position."},{"type":"log","tags":["Agent Brown"],"args":"The sentinels are standing by.."},{"type":"log","tags":["Agent Jones"],"args":"Order the strike!"},{"type":"log","tags":["Agent Smith"],"args":"They're not out _yet_..."},{"type":"warn","tags":["INFO"],"args":"The phone in the phone booth starts to ring, just as Neo, Morpheus, and Trinity arrive at the subway station."},{"type":"warn","tags":["INFO"],"args":"They stand outside it, as Neo puts a hand on Morpheus' shoulder."},{"type":"log","tags":["Neo"],"args":"You first, Morpheus.."},{"type":"warn","tags":["INFO"],"args":"Morpheus goes into the phone booth, and picks up the phone. An old homeless man, lying on a bench nearby watches, as Morpheus appears to visibly disintegrate in front of them, and the phone drops, dangling by it's cord."},{"type":"warn","tags":["INFO"],"args":"His eyes grow wide and he stares."},{"type":"warn","tags":["INFO"],"args":"Trinity is about to answer the phone, when she suddenly stops and turns to Neo."},{"type":"log","tags":["Trinity"],"args":"Neo, I want to tell you something...but I'm afraid of what it would mean if I do..."},{"type":"warn","tags":["INFO"],"args":"Neo looks at her."},{"type":"log","tags":["Trinity"],"args":"Everything the Oracle has told me has come true. Everything but this."},{"type":"warn","tags":["INFO"],"args":"She changes her mind, and walks into the phone booth. She picks up, just as the old man changes into Agent Smith and aims a gun at the phone box. She puts her hand up, as she did in the beginning to stop the truck, and is pulled back into the real world, just as Agent Smith shoots the phone."},{"type":"warn","tags":["INFO"],"args":"Trinity sits up, as Tank stares at her."},{"type":"log","tags":["Trinity"],"args":"Neo!"},{"type":"log","tags":["Tank"],"args":"What the hell just happened?"},{"type":"log","tags":["Trinity"],"args":"An agent! You have to send me back!"},{"type":"log","tags":["Tank"],"args":"I can't!"},{"type":"warn","tags":["INFO"],"args":"Neo stares at the exit to the subway station, as Agent Smith approaches him, smirking."},{"type":"log","tags":["Neo"],"args":"Mr. _Anderson_! We meet again.."},{"type":"warn","tags":["INFO"],"args":"Trinity, Morpheus, and Tank are watching him on the monitor."},{"type":"log","tags":["Trinity"],"args":"Run, Neo! Run!"},{"type":"warn","tags":["INFO"],"args":"Neo looks as though he may be about to do just that, but suddenly he spins around and stares Agent Smith straight in the face, a focused look on his face."},{"type":"log","tags":["Trinity"],"args":"What is he doing?!"},{"type":"warn","tags":["INFO"],"args":"Morpheus half-smiles to himself."},{"type":"log","tags":["Morpheus"],"args":"He's beginning to believe..."},{"type":"warn","tags":["INFO"],"args":"Neo and Agent Smith are standing at opposite ends of the station. Neo takes a deep breath, focusing. He clenches his hands into fists, and relaxes them, pushing his fingers outwards."},{"type":"warn","tags":["INFO"],"args":"Suddenly they both lunge for their guns, firing, as they run up the walls, and meet in the middle of the room, suspended in mid air, as bullets fly all around them. They fall to the ground, guns at each other's heads. Agent Smith smiles."},{"type":"log","tags":["Agent Smith"],"args":"You're _empty_..."},{"type":"warn","tags":["INFO"],"args":"Neo scowls at him."},{"type":"log","tags":["Neo"],"args":"So are _you_!"},{"type":"warn","tags":["INFO"],"args":"They stay there for a moment, as Agent Smith's smile fades, and he stands up, throwing away his gun. Neo shrugs and follows suit, chucking his gun away to the side. Agent Smith attacks Neo, fists flying at furious speed, blows and counters, Neo just ducks in time to miss Agent Smith's fist slamming through the wall behind him. Neo attacks again with renewed strength, as he kicks Agent Smith's head hard, knocking half of his sunglasses off."},{"type":"warn","tags":["INFO"],"args":"Agent Smith glares at him, grimacing."},{"type":"log","tags":["Agent Smith"],"args":"I'm going to _enjoy_ watching you die..._Mr._ Anderson!"},{"type":"warn","tags":["INFO"],"args":"He attacks Neo furiously, punching him with incredible force and sending him flying across the room and into the wall. He falls, face down onto the concrete, as Trinity, watching the whole thing, rips up a piece of cloth, and daps the blood coming from his mouth."},{"type":"log","tags":["Trinity"],"args":"Jesus, he's killing him."},{"type":"warn","tags":["INFO"],"args":"She holds the cloth against his mouth to stop the bleeding."},{"type":"warn","tags":["INFO"],"args":"Neo lies on the floor, in pain. Agent Smith smiles to himself, but Neo supports himself on his hands, and spits the blood in his mouth onto the ground, before getting up and turning round to face Agent Smith. Neo attacks him again, and for a while it seems like he's going to win, he's much stronger and faster. But then Agent Smith grabs hold of him, lifting him into the air, hurling him against the curved wall of the train tunnel, where he falls inches from the electrified third-rail. He jumps down beside Neo, who is lying on the rails, barely conscious. Agent Smith grabs him by the neck and lifts him up, choking him. They hear the sound of an on-coming train."},{"type":"log","tags":["Agent Smith"],"args":"Do you hear _that_, _Mr._ Anderson? That..is the sound of inevitability..._that_ is the sound of...your death. Goodbye..._Mr._ Anderson."},{"type":"warn","tags":["INFO"],"args":"Neo manages to get enough air to speak."},{"type":"log","tags":["Neo"],"args":"My name...is.._Neo_!"},{"type":"warn","tags":["INFO"],"args":"With the last of his strength, he pushes Agent Smith up into the air with him, slams him down onto the track, looks at the on-coming train briefly, and jumps up onto the edge, just in time to get out of the way of the train. Agent Smith is flattened under the train."},{"type":"warn","tags":["INFO"],"args":"Trinity smiles as this happens, but the smile is quickly wiped off her face, as Tank turns around with a very worried expression on his face."},{"type":"log","tags":["Trinity"],"args":"What happened?"},{"type":"log","tags":["Tank"],"args":"I don't know. I lost him...oh sh*t..."},{"type":"warn","tags":["INFO"],"args":"He sees that sentinels are approaching their ship, and turns to Morpheus"},{"type":"log","tags":["Trinity"],"args":"Sentinels! How long?"},{"type":"log","tags":["Morpheus"],"args":"Five, maybe six, minutes...Tank, charge the EMP"},{"type":"log","tags":["Trinity"],"args":"You can't use that until he's out!"},{"type":"log","tags":["Morpheus"],"args":"I know, Trinity...don't worry - he's going to make it..."},{"type":"warn","tags":["INFO"],"args":"Neo is running down the road, away from Agent Smith, who came back out the subway train straight after it flattened him."},{"type":"warn","tags":["INFO"],"args":"As he runs, he notices a man talking on a cell phone. As he runs by the man, he grabs the phone."},{"type":"log","tags":["Man"],"args":"Sh*t! Hey! That's my phone! That guy's got my phone! That's my best phone!"},{"type":"warn","tags":["INFO"],"args":"Tank manages to pin-point Neo's location."},{"type":"log","tags":["Tank"],"args":"Got him! ...He's on the run.."},{"type":"warn","tags":["INFO"],"args":"Neo calls him up."},{"type":"log","tags":["Neo"],"args":"Mr. Wizard! Get me the hell out of here!!"},{"type":"log","tags":["Tank"],"args":"Got a patch on an old exit, Wabash and Lake!"},{"type":"warn","tags":["INFO"],"args":"Neo runs for it, as various people around him turn into the agents, and cause chaos among the people walking the streets."},{"type":"warn","tags":["INFO"],"args":"As Neo heads for the hotel, he comes to a dead end, as an agent is approaching. He talks to Tank."},{"type":"log","tags":["Neo"],"args":"Sh*t! Uh..Help?! Need a little help here!"},{"type":"log","tags":["Tank"],"args":"Door!"},{"type":"warn","tags":["INFO"],"args":"A door appears to Neo's right, and he runs through it."},{"type":"log","tags":["Tank"],"args":"Door on your left!"},{"type":"warn","tags":["INFO"],"args":"Neo goes to the right"},{"type":"log","tags":["Tank"],"args":"No, you're _other_ left!"},{"type":"warn","tags":["INFO"],"args":"Neo bangs the door down"},{"type":"log","tags":["Tank"],"args":"Back door!"},{"type":"warn","tags":["INFO"],"args":"Neo dashes through the room, just missing being hit by a woman taken over by an agent, who through a knife at his head."},{"type":"warn","tags":["INFO"],"args":"The sentinels have arrived at the Nebuchadnezzar"},{"type":"log","tags":["Trinity"],"args":"Oh no..."},{"type":"log","tags":["Morpheus"],"args":"Here they come..."},{"type":"warn","tags":["INFO"],"args":"Morpheus charges the EMP"},{"type":"warn","tags":["INFO"],"args":"Trinity looks at him"},{"type":"log","tags":["Morpheus"],"args":"He's _going_ to make it..."},{"type":"warn","tags":["INFO"],"args":"As he reaches the hotel, Tank gives the last directions."},{"type":"log","tags":["Tank"],"args":"Fire escape at the end of the alley, room 303!"},{"type":"warn","tags":["INFO"],"args":"Neo chucks the phone away, and starts to go up the fire escape, closely followed by the 3 agents, constantly firing their rifles at him."},{"type":"warn","tags":["INFO"],"args":"The sentinels are drilling through the hull of the Nebuchadnezzar. The computer warns the crew of the hull breech."},{"type":"log","tags":["Tank"],"args":"They're inside.."},{"type":"warn","tags":["INFO"],"args":"Trinity wipes Neo's forehead with a cloth and whispers in his ear"},{"type":"log","tags":["Trinity"],"args":"Hurry, Neo..."},{"type":"warn","tags":["INFO"],"args":"Neo gets into the hotel, and runs along the corrider until he reaches room 303. He can hear the sound of the phone ringing from within the room, as he opens the door. He comes face to face with Agent Smith, who looks him straight in the eyes, and shoots him. Neo touches his wound, as blood comes out onto his hand. He looks up at Agent Smith, as he shoots Neo again, and he stumbles back against the wall. Agent Smith shoots him a few more times just to make sure, and he slides down the wall, and slumps on the floor."},{"type":"warn","tags":["INFO"],"args":"Trinity and Morpheus watch his life signs go dead."},{"type":"warn","tags":["INFO"],"args":"They are stunned."},{"type":"log","tags":["Morpheus"],"args":"Can't be..."},{"type":"warn","tags":["INFO"],"args":"Agent Smith looks sceptical about whether Neo is actually dead or not. He nods to the other agents."},{"type":"log","tags":["Agent Smith"],"args":"Check him!"},{"type":"warn","tags":["INFO"],"args":"Agent Brown checks his pulse"},{"type":"log","tags":["Agent Brown"],"args":"He's _gone_..."},{"type":"warn","tags":["INFO"],"args":"They turn and start to walk away, but Agent Smith turns round and smirks at Neo's body"},{"type":"log","tags":["Agent Smith"],"args":"Goodbye......_Mr._ Anderson..."},{"type":"warn","tags":["INFO"],"args":"The sentinels have broken through and are now on the main deck, ripping everything apart. Trinity is still sitting by Neo."},{"type":"log","tags":["Trinity"],"args":"Neo..I'm not afraid anymore! The Oracle told me I would fall in love, and that man, the man that I loved, would be The One. So, you see, you can't be dead...you can't be... because I love you....you hear me? I _love_ you..."},{"type":"warn","tags":["INFO"],"args":"She leans over and kisses him"},{"type":"warn","tags":["INFO"],"args":"As she says this, the blow echoes deep in Neo's mind. In the Matrix, his eyes snap open. Trinity screams as his life monitors jump back to life. Tank and Morpheus stare, in disbelief."},{"type":"log","tags":["Trinity"],"args":"Now get up!!"},{"type":"warn","tags":["INFO"],"args":"Neo sits up, trying to focus. He stands up, and the Agents turn around, staring at him, also in disbelief. Agent Smith grimaces and aims his rifle at Neo. He fires."},{"type":"log","tags":["Neo"],"args":"...No...!"},{"type":"warn","tags":["INFO"],"args":"As Agent Smith fires, Neo just puts his hand out. The bullets slow down and stop in front of him. Neo looks at them, and picks one up. He looks at it, and then drops it to the floor. He looks at the rest, and moves his head down. They all fall to the ground. The Agents stare, and all take a step back."},{"type":"log","tags":["Tank"],"args":"_How_!?!"},{"type":"log","tags":["Morpheus"],"args":"He is...The _One_..."},{"type":"warn","tags":["INFO"],"args":"Neo looks at Agent Smith, and runs towards him. Like the agents do, he appears to go inside Agent Smith's body, eventually bursting through his skin, as pieces of the agent that look something like green glass fly all over the room. As we watch Neo, he looks down at the ground with his eyes shut. The room appears to bend, like the spoon boy's spoon. Neo's eyes snap open and he looks up at the two remaining agents. They look at each other, and run for it. For a moment, we see the room as it is through Neo's eyes now, 3D matrix code."},{"type":"warn","tags":["INFO"],"args":"The sentinels are slowly destroying the whole ship, as one looms near Trinity, who ducks to cover Neo."},{"type":"warn","tags":["INFO"],"args":"In the Matrix, Neo lunges for the phone, just as Morpheus uses the EMP to destroy the sentinels. Neo's eyes open, and he smiles at Trinity as he kisses her."},{"type":"warn","tags":["INFO"],"args":"We see a screen like the one at the beginning. Matrix code appears as Neo begins to speak. A box which says system failure appears on the screen."},{"type":"log","tags":["Neo"],"args":"I know you're out there...I can feel you now. I know that you're afraid. You're afraid of us, you're afraid of change...I don't know the future...I didn't come here to tell you how this is going to end, I came here to tell you how this is going to begin. Now, I'm going to hang up this phone, and I'm going to show these people what you don't want them to see. I'm going to show them a world without you...a world without rules and controls, without borders or boundaries. A world...where anything is possible."},{"type":"warn","tags":["INFO"],"args":"We travel down a phone line, as we see that Neo is in a phone box."},{"type":"log","tags":["Neo"],"args":"Where we go from there...is a choice I leave to you..."},{"type":"warn","tags":["INFO"],"args":"Neo hangs up the phone, as he steps out of the phone booth, and puts on his sunglasses. He looks around the street for a moment, and then flies off."},{"type":"log","tags":["the"],"args":"end"}]